/* automatically generated by rust-bindgen 0.72.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2Y: u32 = 0;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 202405;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_XOPEN2K24: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;

pub const RETRO_SIMD_POPCNT: u32 = 262144;
pub const RETRO_SIMD_MOVBE: u32 = 524288;
pub const RETRO_SIMD_CMOV: u32 = 1048576;
pub const RETRO_SIMD_ASIMD: u32 = 2097152;
pub const RETRO_SENSOR_ACCELEROMETER_X: u32 = 0;
pub const RETRO_SENSOR_ACCELEROMETER_Y: u32 = 1;
pub const RETRO_SENSOR_ACCELEROMETER_Z: u32 = 2;
pub const RETRO_SENSOR_GYROSCOPE_X: u32 = 3;
pub const RETRO_SENSOR_GYROSCOPE_Y: u32 = 4;
pub const RETRO_SENSOR_GYROSCOPE_Z: u32 = 5;
pub const RETRO_SENSOR_ILLUMINANCE: u32 = 6;
pub const RETRO_NETPACKET_UNRELIABLE: u32 = 0;
pub const RETRO_NETPACKET_RELIABLE: u32 = 1;
pub const RETRO_NETPACKET_UNSEQUENCED: u32 = 2;
pub const RETRO_NETPACKET_FLUSH_HINT: u32 = 4;
pub const RETRO_NETPACKET_BROADCAST: u32 = 65535;
pub const RETRO_NUM_CORE_OPTION_VALUES_MAX: u32 = 128;
pub const RETRO_MEMORY_ACCESS_WRITE: u32 = 1;
pub const RETRO_MEMORY_ACCESS_READ: u32 = 2;
pub const RETRO_MEMORY_TYPE_CACHED: u32 = 1;
pub const RETRO_THROTTLE_NONE: u32 = 0;
pub const RETRO_THROTTLE_FRAME_STEPPING: u32 = 1;
pub const RETRO_THROTTLE_FAST_FORWARD: u32 = 2;
pub const RETRO_THROTTLE_SLOW_MOTION: u32 = 3;
pub const RETRO_THROTTLE_REWINDING: u32 = 4;
pub const RETRO_THROTTLE_VSYNC: u32 = 5;
pub const RETRO_THROTTLE_UNBLOCKED: u32 = 6;
pub const RETRO_MICROPHONE_INTERFACE_VERSION: u32 = 1;
pub const RETRO_POWERSTATE_NO_ESTIMATE: i32 = -1;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub const RETRO_LANGUAGE_ENGLISH: retro_language = 0;
pub const RETRO_LANGUAGE_JAPANESE: retro_language = 1;
pub const RETRO_LANGUAGE_FRENCH: retro_language = 2;
pub const RETRO_LANGUAGE_SPANISH: retro_language = 3;
pub const RETRO_LANGUAGE_GERMAN: retro_language = 4;
pub const RETRO_LANGUAGE_ITALIAN: retro_language = 5;
pub const RETRO_LANGUAGE_DUTCH: retro_language = 6;
pub const RETRO_LANGUAGE_PORTUGUESE_BRAZIL: retro_language = 7;
pub const RETRO_LANGUAGE_PORTUGUESE_PORTUGAL: retro_language = 8;
pub const RETRO_LANGUAGE_RUSSIAN: retro_language = 9;
pub const RETRO_LANGUAGE_KOREAN: retro_language = 10;
pub const RETRO_LANGUAGE_CHINESE_TRADITIONAL: retro_language = 11;
pub const RETRO_LANGUAGE_CHINESE_SIMPLIFIED: retro_language = 12;
pub const RETRO_LANGUAGE_ESPERANTO: retro_language = 13;
pub const RETRO_LANGUAGE_POLISH: retro_language = 14;
pub const RETRO_LANGUAGE_VIETNAMESE: retro_language = 15;
pub const RETRO_LANGUAGE_ARABIC: retro_language = 16;
pub const RETRO_LANGUAGE_GREEK: retro_language = 17;
pub const RETRO_LANGUAGE_TURKISH: retro_language = 18;
pub const RETRO_LANGUAGE_SLOVAK: retro_language = 19;
pub const RETRO_LANGUAGE_PERSIAN: retro_language = 20;
pub const RETRO_LANGUAGE_HEBREW: retro_language = 21;
pub const RETRO_LANGUAGE_ASTURIAN: retro_language = 22;
pub const RETRO_LANGUAGE_FINNISH: retro_language = 23;
pub const RETRO_LANGUAGE_INDONESIAN: retro_language = 24;
pub const RETRO_LANGUAGE_SWEDISH: retro_language = 25;
pub const RETRO_LANGUAGE_UKRAINIAN: retro_language = 26;
pub const RETRO_LANGUAGE_CZECH: retro_language = 27;
pub const RETRO_LANGUAGE_CATALAN_VALENCIA: retro_language = 28;
pub const RETRO_LANGUAGE_CATALAN: retro_language = 29;
pub const RETRO_LANGUAGE_BRITISH_ENGLISH: retro_language = 30;
pub const RETRO_LANGUAGE_HUNGARIAN: retro_language = 31;
pub const RETRO_LANGUAGE_BELARUSIAN: retro_language = 32;
pub const RETRO_LANGUAGE_GALICIAN: retro_language = 33;
pub const RETRO_LANGUAGE_NORWEGIAN: retro_language = 34;
pub const RETRO_LANGUAGE_LAST: retro_language = 35;
#[doc = " Defined to ensure that <tt>sizeof(retro_language) == sizeof(int)</tt>. Do not use."]
pub const RETRO_LANGUAGE_DUMMY: retro_language = 2147483647;
#[doc = " Identifiers for supported languages.\n @see RETRO_ENVIRONMENT_GET_LANGUAGE"]
pub type retro_language = ::std::os::raw::c_uint;
pub const RETROK_UNKNOWN: retro_key = 0;
pub const RETROK_FIRST: retro_key = 0;
pub const RETROK_BACKSPACE: retro_key = 8;
pub const RETROK_TAB: retro_key = 9;
pub const RETROK_CLEAR: retro_key = 12;
pub const RETROK_RETURN: retro_key = 13;
pub const RETROK_PAUSE: retro_key = 19;
pub const RETROK_ESCAPE: retro_key = 27;
pub const RETROK_SPACE: retro_key = 32;
pub const RETROK_EXCLAIM: retro_key = 33;
pub const RETROK_QUOTEDBL: retro_key = 34;
pub const RETROK_HASH: retro_key = 35;
pub const RETROK_DOLLAR: retro_key = 36;
pub const RETROK_AMPERSAND: retro_key = 38;
pub const RETROK_QUOTE: retro_key = 39;
pub const RETROK_LEFTPAREN: retro_key = 40;
pub const RETROK_RIGHTPAREN: retro_key = 41;
pub const RETROK_ASTERISK: retro_key = 42;
pub const RETROK_PLUS: retro_key = 43;
pub const RETROK_COMMA: retro_key = 44;
pub const RETROK_MINUS: retro_key = 45;
pub const RETROK_PERIOD: retro_key = 46;
pub const RETROK_SLASH: retro_key = 47;
pub const RETROK_0: retro_key = 48;
pub const RETROK_1: retro_key = 49;
pub const RETROK_2: retro_key = 50;
pub const RETROK_3: retro_key = 51;
pub const RETROK_4: retro_key = 52;
pub const RETROK_5: retro_key = 53;
pub const RETROK_6: retro_key = 54;
pub const RETROK_7: retro_key = 55;
pub const RETROK_8: retro_key = 56;
pub const RETROK_9: retro_key = 57;
pub const RETROK_COLON: retro_key = 58;
pub const RETROK_SEMICOLON: retro_key = 59;
pub const RETROK_LESS: retro_key = 60;
pub const RETROK_EQUALS: retro_key = 61;
pub const RETROK_GREATER: retro_key = 62;
pub const RETROK_QUESTION: retro_key = 63;
pub const RETROK_AT: retro_key = 64;
pub const RETROK_LEFTBRACKET: retro_key = 91;
pub const RETROK_BACKSLASH: retro_key = 92;
pub const RETROK_RIGHTBRACKET: retro_key = 93;
pub const RETROK_CARET: retro_key = 94;
pub const RETROK_UNDERSCORE: retro_key = 95;
pub const RETROK_BACKQUOTE: retro_key = 96;
pub const RETROK_a: retro_key = 97;
pub const RETROK_b: retro_key = 98;
pub const RETROK_c: retro_key = 99;
pub const RETROK_d: retro_key = 100;
pub const RETROK_e: retro_key = 101;
pub const RETROK_f: retro_key = 102;
pub const RETROK_g: retro_key = 103;
pub const RETROK_h: retro_key = 104;
pub const RETROK_i: retro_key = 105;
pub const RETROK_j: retro_key = 106;
pub const RETROK_k: retro_key = 107;
pub const RETROK_l: retro_key = 108;
pub const RETROK_m: retro_key = 109;
pub const RETROK_n: retro_key = 110;
pub const RETROK_o: retro_key = 111;
pub const RETROK_p: retro_key = 112;
pub const RETROK_q: retro_key = 113;
pub const RETROK_r: retro_key = 114;
pub const RETROK_s: retro_key = 115;
pub const RETROK_t: retro_key = 116;
pub const RETROK_u: retro_key = 117;
pub const RETROK_v: retro_key = 118;
pub const RETROK_w: retro_key = 119;
pub const RETROK_x: retro_key = 120;
pub const RETROK_y: retro_key = 121;
pub const RETROK_z: retro_key = 122;
pub const RETROK_LEFTBRACE: retro_key = 123;
pub const RETROK_BAR: retro_key = 124;
pub const RETROK_RIGHTBRACE: retro_key = 125;
pub const RETROK_TILDE: retro_key = 126;
pub const RETROK_DELETE: retro_key = 127;
pub const RETROK_KP0: retro_key = 256;
pub const RETROK_KP1: retro_key = 257;
pub const RETROK_KP2: retro_key = 258;
pub const RETROK_KP3: retro_key = 259;
pub const RETROK_KP4: retro_key = 260;
pub const RETROK_KP5: retro_key = 261;
pub const RETROK_KP6: retro_key = 262;
pub const RETROK_KP7: retro_key = 263;
pub const RETROK_KP8: retro_key = 264;
pub const RETROK_KP9: retro_key = 265;
pub const RETROK_KP_PERIOD: retro_key = 266;
pub const RETROK_KP_DIVIDE: retro_key = 267;
pub const RETROK_KP_MULTIPLY: retro_key = 268;
pub const RETROK_KP_MINUS: retro_key = 269;
pub const RETROK_KP_PLUS: retro_key = 270;
pub const RETROK_KP_ENTER: retro_key = 271;
pub const RETROK_KP_EQUALS: retro_key = 272;
pub const RETROK_UP: retro_key = 273;
pub const RETROK_DOWN: retro_key = 274;
pub const RETROK_RIGHT: retro_key = 275;
pub const RETROK_LEFT: retro_key = 276;
pub const RETROK_INSERT: retro_key = 277;
pub const RETROK_HOME: retro_key = 278;
pub const RETROK_END: retro_key = 279;
pub const RETROK_PAGEUP: retro_key = 280;
pub const RETROK_PAGEDOWN: retro_key = 281;
pub const RETROK_F1: retro_key = 282;
pub const RETROK_F2: retro_key = 283;
pub const RETROK_F3: retro_key = 284;
pub const RETROK_F4: retro_key = 285;
pub const RETROK_F5: retro_key = 286;
pub const RETROK_F6: retro_key = 287;
pub const RETROK_F7: retro_key = 288;
pub const RETROK_F8: retro_key = 289;
pub const RETROK_F9: retro_key = 290;
pub const RETROK_F10: retro_key = 291;
pub const RETROK_F11: retro_key = 292;
pub const RETROK_F12: retro_key = 293;
pub const RETROK_F13: retro_key = 294;
pub const RETROK_F14: retro_key = 295;
pub const RETROK_F15: retro_key = 296;
pub const RETROK_NUMLOCK: retro_key = 300;
pub const RETROK_CAPSLOCK: retro_key = 301;
pub const RETROK_SCROLLOCK: retro_key = 302;
pub const RETROK_RSHIFT: retro_key = 303;
pub const RETROK_LSHIFT: retro_key = 304;
pub const RETROK_RCTRL: retro_key = 305;
pub const RETROK_LCTRL: retro_key = 306;
pub const RETROK_RALT: retro_key = 307;
pub const RETROK_LALT: retro_key = 308;
pub const RETROK_RMETA: retro_key = 309;
pub const RETROK_LMETA: retro_key = 310;
pub const RETROK_LSUPER: retro_key = 311;
pub const RETROK_RSUPER: retro_key = 312;
pub const RETROK_MODE: retro_key = 313;
pub const RETROK_COMPOSE: retro_key = 314;
pub const RETROK_HELP: retro_key = 315;
pub const RETROK_PRINT: retro_key = 316;
pub const RETROK_SYSREQ: retro_key = 317;
pub const RETROK_BREAK: retro_key = 318;
pub const RETROK_MENU: retro_key = 319;
pub const RETROK_POWER: retro_key = 320;
pub const RETROK_EURO: retro_key = 321;
pub const RETROK_UNDO: retro_key = 322;
pub const RETROK_OEM_102: retro_key = 323;
pub const RETROK_BROWSER_BACK: retro_key = 324;
pub const RETROK_BROWSER_FORWARD: retro_key = 325;
pub const RETROK_BROWSER_REFRESH: retro_key = 326;
pub const RETROK_BROWSER_STOP: retro_key = 327;
pub const RETROK_BROWSER_SEARCH: retro_key = 328;
pub const RETROK_BROWSER_FAVORITES: retro_key = 329;
pub const RETROK_BROWSER_HOME: retro_key = 330;
pub const RETROK_VOLUME_MUTE: retro_key = 331;
pub const RETROK_VOLUME_DOWN: retro_key = 332;
pub const RETROK_VOLUME_UP: retro_key = 333;
pub const RETROK_MEDIA_NEXT: retro_key = 334;
pub const RETROK_MEDIA_PREV: retro_key = 335;
pub const RETROK_MEDIA_STOP: retro_key = 336;
pub const RETROK_MEDIA_PLAY_PAUSE: retro_key = 337;
pub const RETROK_LAUNCH_MAIL: retro_key = 338;
pub const RETROK_LAUNCH_MEDIA: retro_key = 339;
pub const RETROK_LAUNCH_APP1: retro_key = 340;
pub const RETROK_LAUNCH_APP2: retro_key = 341;
pub const RETROK_LAST: retro_key = 342;
pub const RETROK_DUMMY: retro_key = 2147483647;
#[doc = " @}"]
pub type retro_key = ::std::os::raw::c_uint;
pub const RETROKMOD_NONE: retro_mod = 0;
pub const RETROKMOD_SHIFT: retro_mod = 1;
pub const RETROKMOD_CTRL: retro_mod = 2;
pub const RETROKMOD_ALT: retro_mod = 4;
pub const RETROKMOD_META: retro_mod = 8;
pub const RETROKMOD_NUMLOCK: retro_mod = 16;
pub const RETROKMOD_CAPSLOCK: retro_mod = 32;
pub const RETROKMOD_SCROLLOCK: retro_mod = 64;
pub const RETROKMOD_DUMMY: retro_mod = 2147483647;
pub type retro_mod = ::std::os::raw::c_uint;
#[doc = " Opaque file handle.\n @since VFS API v1"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_vfs_file_handle {
    _unused: [u8; 0],
}
#[doc = " Opaque directory handle.\n @since VFS API v3"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_vfs_dir_handle {
    _unused: [u8; 0],
}
#[doc = " Returns the path that was used to open this file.\n\n @param stream The opened file handle to get the path of.\n Behavior is undefined if \\c NULL or closed.\n @return The path that was used to open \\c stream.\n The string is owned by \\c stream and must not be modified.\n @since VFS API v1\n @see filestream_get_path"]
pub type retro_vfs_get_path_t = ::std::option::Option<
    unsafe extern "C" fn(stream: *mut retro_vfs_file_handle) -> *const ::std::os::raw::c_char,
>;
#[doc = " Open a file for reading or writing.\n\n @param path The path to open.\n @param mode A bitwise combination of \\c RETRO_VFS_FILE_ACCESS flags.\n At a minimum, one of \\c RETRO_VFS_FILE_ACCESS_READ or \\c RETRO_VFS_FILE_ACCESS_WRITE must be specified.\n @param hints A bitwise combination of \\c RETRO_VFS_FILE_ACCESS_HINT flags.\n @return A handle to the opened file,\n or \\c NULL upon failure.\n Note that this will return \\c NULL if \\c path names a directory.\n The returned file handle must be closed with \\c retro_vfs_close_t.\n @since VFS API v1\n @see File Paths\n @see RETRO_VFS_FILE_ACCESS\n @see RETRO_VFS_FILE_ACCESS_HINT\n @see retro_vfs_close_t\n @see filestream_open"]
pub type retro_vfs_open_t = ::std::option::Option<
    unsafe extern "C" fn(
        path: *const ::std::os::raw::c_char,
        mode: ::std::os::raw::c_uint,
        hints: ::std::os::raw::c_uint,
    ) -> *mut retro_vfs_file_handle,
>;
#[doc = " Close the file and release its resources.\n All files returned by \\c retro_vfs_open_t must be closed with this function.\n\n @param stream The file handle to close.\n Behavior is undefined if already closed.\n Upon completion of this function, \\c stream is no longer valid\n (even if it returns failure).\n @return 0 on success, -1 on failure or if \\c stream is \\c NULL.\n @see retro_vfs_open_t\n @see filestream_close\n @since VFS API v1"]
pub type retro_vfs_close_t = ::std::option::Option<
    unsafe extern "C" fn(stream: *mut retro_vfs_file_handle) -> ::std::os::raw::c_int,
>;
#[doc = " Return the size of the file in bytes.\n\n @param stream The file to query the size of.\n @return Size of the file in bytes, or -1 if there was an error.\n @see filestream_get_size\n @since VFS API v1"]
pub type retro_vfs_size_t =
    ::std::option::Option<unsafe extern "C" fn(stream: *mut retro_vfs_file_handle) -> i64>;
#[doc = " Set the file's length.\n\n @param stream The file whose length will be adjusted.\n @param length The new length of the file, in bytes.\n If shorter than the original length, the extra bytes will be discarded.\n If longer, the file's padding is unspecified (and likely platform-dependent).\n @return 0 on success,\n -1 on failure.\n @see filestream_truncate\n @since VFS API v2"]
pub type retro_vfs_truncate_t = ::std::option::Option<
    unsafe extern "C" fn(stream: *mut retro_vfs_file_handle, length: i64) -> i64,
>;
#[doc = " Gets the given file's current read/write position.\n This position is advanced with each call to \\c retro_vfs_read_t or \\c retro_vfs_write_t.\n\n @param stream The file to query the position of.\n @return The current stream position in bytes\n or -1 if there was an error.\n @see filestream_tell\n @since VFS API v1"]
pub type retro_vfs_tell_t =
    ::std::option::Option<unsafe extern "C" fn(stream: *mut retro_vfs_file_handle) -> i64>;
#[doc = " Sets the given file handle's current read/write position.\n\n @param stream The file to set the position of.\n @param offset The new position, in bytes.\n @param seek_position The position to seek from.\n @return The new position,\n or -1 if there was an error.\n @since VFS API v1\n @see File Seek Positions\n @see filestream_seek"]
pub type retro_vfs_seek_t = ::std::option::Option<
    unsafe extern "C" fn(
        stream: *mut retro_vfs_file_handle,
        offset: i64,
        seek_position: ::std::os::raw::c_int,
    ) -> i64,
>;
#[doc = " Read data from a file, if it was opened for reading.\n\n @param stream The file to read from.\n @param s The buffer to read into.\n @param len The number of bytes to read.\n The buffer pointed to by \\c s must be this large.\n @return The number of bytes read,\n or -1 if there was an error.\n @since VFS API v1\n @see filestream_read"]
pub type retro_vfs_read_t = ::std::option::Option<
    unsafe extern "C" fn(
        stream: *mut retro_vfs_file_handle,
        s: *mut ::std::os::raw::c_void,
        len: u64,
    ) -> i64,
>;
#[doc = " Write data to a file, if it was opened for writing.\n\n @param stream The file handle to write to.\n @param s The buffer to write from.\n @param len The number of bytes to write.\n The buffer pointed to by \\c s must be this large.\n @return The number of bytes written,\n or -1 if there was an error.\n @since VFS API v1\n @see filestream_write"]
pub type retro_vfs_write_t = ::std::option::Option<
    unsafe extern "C" fn(
        stream: *mut retro_vfs_file_handle,
        s: *const ::std::os::raw::c_void,
        len: u64,
    ) -> i64,
>;
#[doc = " Flush pending writes to the file, if applicable.\n\n This does not mean that the changes will be immediately persisted to disk;\n that may be scheduled for later, depending on the platform.\n\n @param stream The file handle to flush.\n @return 0 on success, -1 on failure.\n @since VFS API v1\n @see filestream_flush"]
pub type retro_vfs_flush_t = ::std::option::Option<
    unsafe extern "C" fn(stream: *mut retro_vfs_file_handle) -> ::std::os::raw::c_int,
>;
#[doc = " Deletes the file at the given path.\n\n @param path The path to the file that will be deleted.\n @return 0 on success, -1 on failure.\n @see filestream_delete\n @since VFS API v1"]
pub type retro_vfs_remove_t = ::std::option::Option<
    unsafe extern "C" fn(path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
>;
#[doc = " Rename the specified file.\n\n @param old_path Path to an existing file.\n @param new_path The destination path.\n Must not name an existing file.\n @return 0 on success, -1 on failure\n @see filestream_rename\n @since VFS API v1"]
pub type retro_vfs_rename_t = ::std::option::Option<
    unsafe extern "C" fn(
        old_path: *const ::std::os::raw::c_char,
        new_path: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " Gets information about the given file.\n\n @param path The path to the file to query.\n @param[out] size The reported size of the file in bytes.\n May be \\c NULL, in which case this value is ignored.\n @return A bitmask of \\c RETRO_VFS_STAT flags,\n or 0 if \\c path doesn't refer to a valid file.\n @see path_stat\n @see path_get_size\n @see RETRO_VFS_STAT\n @since VFS API v3"]
pub type retro_vfs_stat_t = ::std::option::Option<
    unsafe extern "C" fn(
        path: *const ::std::os::raw::c_char,
        size: *mut i32,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " Creates a directory at the given path.\n\n @param dir The desired location of the new directory.\n @return 0 if the directory was created,\n -2 if the directory already exists,\n or -1 if some other error occurred.\n @see path_mkdir\n @since VFS API v3"]
pub type retro_vfs_mkdir_t = ::std::option::Option<
    unsafe extern "C" fn(dir: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
>;
#[doc = " Opens a handle to a directory so its contents can be inspected.\n\n @param dir The path to the directory to open.\n Must be an existing directory.\n @param include_hidden Whether to include hidden files in the directory listing.\n The exact semantics of this flag will depend on the platform.\n @return A handle to the opened directory,\n or \\c NULL if there was an error.\n @see retro_opendir\n @since VFS API v3"]
pub type retro_vfs_opendir_t = ::std::option::Option<
    unsafe extern "C" fn(
        dir: *const ::std::os::raw::c_char,
        include_hidden: bool,
    ) -> *mut retro_vfs_dir_handle,
>;
#[doc = " Gets the next dirent (\"directory entry\")\n within the given directory.\n\n @param[in,out] dirstream The directory to read from.\n Updated to point to the next file, directory, or other path.\n @return \\c true when the next dirent was retrieved,\n \\c false if there are no more dirents to read.\n @note This API iterates over all files and directories within \\c dirstream.\n Remember to check what the type of the current dirent is.\n @note This function does not recurse,\n i.e. it does not return the contents of subdirectories.\n @note This may include \".\" and \"..\" on Unix-like platforms.\n @see retro_readdir\n @see retro_vfs_dirent_is_dir_t\n @since VFS API v3"]
pub type retro_vfs_readdir_t =
    ::std::option::Option<unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> bool>;
#[doc = " Gets the filename of the current dirent.\n\n The returned string pointer is valid\n until the next call to \\c retro_vfs_readdir_t or \\c retro_vfs_closedir_t.\n\n @param dirstream The directory to read from.\n @return The current dirent's name,\n or \\c NULL if there was an error.\n @note This function only returns the file's \\em name,\n not a complete path to it.\n @see retro_dirent_get_name\n @since VFS API v3"]
pub type retro_vfs_dirent_get_name_t = ::std::option::Option<
    unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> *const ::std::os::raw::c_char,
>;
#[doc = " Checks whether the current dirent names a directory.\n\n @param dirstream The directory to read from.\n @return \\c true if \\c dirstream's current dirent points to a directory,\n \\c false if not or if there was an error.\n @see retro_dirent_is_dir\n @since VFS API v3"]
pub type retro_vfs_dirent_is_dir_t =
    ::std::option::Option<unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> bool>;
#[doc = " Closes the given directory and release its resources.\n\n Must be called on any \\c retro_vfs_dir_handle returned by \\c retro_vfs_open_t.\n\n @param dirstream The directory to close.\n When this function returns (even failure),\n \\c dirstream will no longer be valid and must not be used.\n @return 0 on success, -1 on failure.\n @see retro_closedir\n @since VFS API v3"]
pub type retro_vfs_closedir_t = ::std::option::Option<
    unsafe extern "C" fn(dirstream: *mut retro_vfs_dir_handle) -> ::std::os::raw::c_int,
>;
#[doc = " File system interface exposed by the frontend.\n\n @see dirent_vfs_init\n @see filestream_vfs_init\n @see path_vfs_init\n @see RETRO_ENVIRONMENT_GET_VFS_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_vfs_interface {
    #[doc = " @copydoc retro_vfs_get_path_t"]
    pub get_path: retro_vfs_get_path_t,
    #[doc = " @copydoc retro_vfs_open_t"]
    pub open: retro_vfs_open_t,
    #[doc = " @copydoc retro_vfs_close_t"]
    pub close: retro_vfs_close_t,
    #[doc = " @copydoc retro_vfs_size_t"]
    pub size: retro_vfs_size_t,
    #[doc = " @copydoc retro_vfs_tell_t"]
    pub tell: retro_vfs_tell_t,
    #[doc = " @copydoc retro_vfs_seek_t"]
    pub seek: retro_vfs_seek_t,
    #[doc = " @copydoc retro_vfs_read_t"]
    pub read: retro_vfs_read_t,
    #[doc = " @copydoc retro_vfs_write_t"]
    pub write: retro_vfs_write_t,
    #[doc = " @copydoc retro_vfs_flush_t"]
    pub flush: retro_vfs_flush_t,
    #[doc = " @copydoc retro_vfs_remove_t"]
    pub remove: retro_vfs_remove_t,
    #[doc = " @copydoc retro_vfs_rename_t"]
    pub rename: retro_vfs_rename_t,
    #[doc = " @copydoc retro_vfs_truncate_t"]
    pub truncate: retro_vfs_truncate_t,
    #[doc = " @copydoc retro_vfs_stat_t"]
    pub stat: retro_vfs_stat_t,
    #[doc = " @copydoc retro_vfs_mkdir_t"]
    pub mkdir: retro_vfs_mkdir_t,
    #[doc = " @copydoc retro_vfs_opendir_t"]
    pub opendir: retro_vfs_opendir_t,
    #[doc = " @copydoc retro_vfs_readdir_t"]
    pub readdir: retro_vfs_readdir_t,
    #[doc = " @copydoc retro_vfs_dirent_get_name_t"]
    pub dirent_get_name: retro_vfs_dirent_get_name_t,
    #[doc = " @copydoc retro_vfs_dirent_is_dir_t"]
    pub dirent_is_dir: retro_vfs_dirent_is_dir_t,
    #[doc = " @copydoc retro_vfs_closedir_t"]
    pub closedir: retro_vfs_closedir_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_vfs_interface"][::std::mem::size_of::<retro_vfs_interface>() - 152usize];
    ["Alignment of retro_vfs_interface"][::std::mem::align_of::<retro_vfs_interface>() - 8usize];
    ["Offset of field: retro_vfs_interface::get_path"]
        [::std::mem::offset_of!(retro_vfs_interface, get_path) - 0usize];
    ["Offset of field: retro_vfs_interface::open"]
        [::std::mem::offset_of!(retro_vfs_interface, open) - 8usize];
    ["Offset of field: retro_vfs_interface::close"]
        [::std::mem::offset_of!(retro_vfs_interface, close) - 16usize];
    ["Offset of field: retro_vfs_interface::size"]
        [::std::mem::offset_of!(retro_vfs_interface, size) - 24usize];
    ["Offset of field: retro_vfs_interface::tell"]
        [::std::mem::offset_of!(retro_vfs_interface, tell) - 32usize];
    ["Offset of field: retro_vfs_interface::seek"]
        [::std::mem::offset_of!(retro_vfs_interface, seek) - 40usize];
    ["Offset of field: retro_vfs_interface::read"]
        [::std::mem::offset_of!(retro_vfs_interface, read) - 48usize];
    ["Offset of field: retro_vfs_interface::write"]
        [::std::mem::offset_of!(retro_vfs_interface, write) - 56usize];
    ["Offset of field: retro_vfs_interface::flush"]
        [::std::mem::offset_of!(retro_vfs_interface, flush) - 64usize];
    ["Offset of field: retro_vfs_interface::remove"]
        [::std::mem::offset_of!(retro_vfs_interface, remove) - 72usize];
    ["Offset of field: retro_vfs_interface::rename"]
        [::std::mem::offset_of!(retro_vfs_interface, rename) - 80usize];
    ["Offset of field: retro_vfs_interface::truncate"]
        [::std::mem::offset_of!(retro_vfs_interface, truncate) - 88usize];
    ["Offset of field: retro_vfs_interface::stat"]
        [::std::mem::offset_of!(retro_vfs_interface, stat) - 96usize];
    ["Offset of field: retro_vfs_interface::mkdir"]
        [::std::mem::offset_of!(retro_vfs_interface, mkdir) - 104usize];
    ["Offset of field: retro_vfs_interface::opendir"]
        [::std::mem::offset_of!(retro_vfs_interface, opendir) - 112usize];
    ["Offset of field: retro_vfs_interface::readdir"]
        [::std::mem::offset_of!(retro_vfs_interface, readdir) - 120usize];
    ["Offset of field: retro_vfs_interface::dirent_get_name"]
        [::std::mem::offset_of!(retro_vfs_interface, dirent_get_name) - 128usize];
    ["Offset of field: retro_vfs_interface::dirent_is_dir"]
        [::std::mem::offset_of!(retro_vfs_interface, dirent_is_dir) - 136usize];
    ["Offset of field: retro_vfs_interface::closedir"]
        [::std::mem::offset_of!(retro_vfs_interface, closedir) - 144usize];
};
#[doc = " Represents a request by the core for the frontend's file system interface,\n as well as the interface itself returned by the frontend.\n\n You do not need to use these functions directly;\n you may pass this struct to \\c dirent_vfs_init,\n \\c filestream_vfs_init, or \\c path_vfs_init\n so that you can use the wrappers provided by these modules.\n\n @see dirent_vfs_init\n @see filestream_vfs_init\n @see path_vfs_init\n @see RETRO_ENVIRONMENT_GET_VFS_INTERFACE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_vfs_interface_info {
    #[doc = " The minimum version of the VFS API that the core requires.\n libretro-common's wrapper API initializers will check this value as well.\n\n Set to the core's desired VFS version when requesting an interface,\n and set by the frontend to indicate its actual API version.\n\n If the core asks for a newer VFS API version than the frontend supports,\n the frontend must return \\c false within the \\c RETRO_ENVIRONMENT_GET_VFS_INTERFACE call.\n @since VFS API v1"]
    pub required_interface_version: u32,
    #[doc = " Set by the frontend.\n The frontend will set this to the VFS interface it provides.\n\n The interface is owned by the frontend\n and must not be modified or freed by the core.\n @since VFS API v1"]
    pub iface: *mut retro_vfs_interface,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_vfs_interface_info"]
        [::std::mem::size_of::<retro_vfs_interface_info>() - 16usize];
    ["Alignment of retro_vfs_interface_info"]
        [::std::mem::align_of::<retro_vfs_interface_info>() - 8usize];
    ["Offset of field: retro_vfs_interface_info::required_interface_version"]
        [::std::mem::offset_of!(retro_vfs_interface_info, required_interface_version) - 0usize];
    ["Offset of field: retro_vfs_interface_info::iface"]
        [::std::mem::offset_of!(retro_vfs_interface_info, iface) - 8usize];
};
impl Default for retro_vfs_interface_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Indicates a \\c retro_hw_render_interface for Vulkan.\n @see retro_hw_render_interface_vulkan"]
pub const RETRO_HW_RENDER_INTERFACE_VULKAN: retro_hw_render_interface_type = 0;
#[doc = " Indicates a \\c retro_hw_render_interface for Direct3D 9."]
pub const RETRO_HW_RENDER_INTERFACE_D3D9: retro_hw_render_interface_type = 1;
#[doc = " Indicates a \\c retro_hw_render_interface for Direct3D 10."]
pub const RETRO_HW_RENDER_INTERFACE_D3D10: retro_hw_render_interface_type = 2;
#[doc = " Indicates a \\c retro_hw_render_interface for Direct3D 11.\n @see retro_hw_render_interface_d3d11"]
pub const RETRO_HW_RENDER_INTERFACE_D3D11: retro_hw_render_interface_type = 3;
#[doc = " Indicates a \\c retro_hw_render_interface for Direct3D 12.\n @see retro_hw_render_interface_d3d12"]
pub const RETRO_HW_RENDER_INTERFACE_D3D12: retro_hw_render_interface_type = 4;
#[doc = " Indicates a \\c retro_hw_render_interface for\n the PlayStation's 2 PSKit API.\n @see retro_hw_render_interface_gskit_ps2"]
pub const RETRO_HW_RENDER_INTERFACE_GSKIT_PS2: retro_hw_render_interface_type = 5;
#[doc = " @private Defined to ensure <tt>sizeof(retro_hw_render_interface_type) == sizeof(int)</tt>.\n Do not use."]
pub const RETRO_HW_RENDER_INTERFACE_DUMMY: retro_hw_render_interface_type = 2147483647;
#[doc = " Describes the hardware rendering API supported by\n a particular subtype of \\c retro_hw_render_interface.\n\n Not every rendering API supported by libretro has its own interface,\n or even needs one.\n\n @see RETRO_ENVIRONMENT_SET_HW_RENDER\n @see RETRO_ENVIRONMENT_GET_HW_RENDER_INTERFACE"]
pub type retro_hw_render_interface_type = ::std::os::raw::c_uint;
#[doc = " Base render interface type.\n All \\c retro_hw_render_interface implementations\n will start with these two fields set to particular values.\n\n @see retro_hw_render_interface_type\n @see RETRO_ENVIRONMENT_SET_HW_RENDER\n @see RETRO_ENVIRONMENT_GET_HW_RENDER_INTERFACE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_hw_render_interface {
    #[doc = " Denotes the particular rendering API that this interface is for.\n Each interface requires this field to be set to a particular value.\n Use it to cast this interface to the appropriate pointer."]
    pub interface_type: retro_hw_render_interface_type,
    #[doc = " The version of this rendering interface.\n @note This is not related to the version of the API itself."]
    pub interface_version: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_hw_render_interface"]
        [::std::mem::size_of::<retro_hw_render_interface>() - 8usize];
    ["Alignment of retro_hw_render_interface"]
        [::std::mem::align_of::<retro_hw_render_interface>() - 4usize];
    ["Offset of field: retro_hw_render_interface::interface_type"]
        [::std::mem::offset_of!(retro_hw_render_interface, interface_type) - 0usize];
    ["Offset of field: retro_hw_render_interface::interface_version"]
        [::std::mem::offset_of!(retro_hw_render_interface, interface_version) - 4usize];
};
impl Default for retro_hw_render_interface {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @copydoc retro_led_interface::set_led_state"]
pub type retro_set_led_state_t = ::std::option::Option<
    unsafe extern "C" fn(led: ::std::os::raw::c_int, state: ::std::os::raw::c_int),
>;
#[doc = " Interface that the core can use to set the state of available LEDs.\n @see RETRO_ENVIRONMENT_GET_LED_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_led_interface {
    #[doc = " Sets the state of an LED.\n\n @param led The LED to set the state of.\n @param state The state to set the LED to.\n \\c true to enable, \\c false to disable."]
    pub set_led_state: retro_set_led_state_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_led_interface"][::std::mem::size_of::<retro_led_interface>() - 8usize];
    ["Alignment of retro_led_interface"][::std::mem::align_of::<retro_led_interface>() - 8usize];
    ["Offset of field: retro_led_interface::set_led_state"]
        [::std::mem::offset_of!(retro_led_interface, set_led_state) - 0usize];
};
#[doc = " If set, the core should render video output with \\c retro_video_refresh_t as normal.\n\n Otherwise, the frontend will discard any video data received this frame,\n including frames presented via hardware acceleration.\n \\c retro_video_refresh_t will do nothing.\n\n @note After running the frame, the video output of the next frame\n should be no different than if video was enabled,\n and saving and loading state should have no issues.\n This implies that the emulated console's graphics pipeline state\n should not be affected by this flag.\n\n @note If emulating a platform that supports display capture\n (i.e. reading its own VRAM),\n the core may not be able to completely skip rendering,\n as the VRAM is part of the graphics pipeline's state."]
pub const RETRO_AV_ENABLE_VIDEO: retro_av_enable_flags = 1;
#[doc = " If set, the core should render audio output\n with \\c retro_audio_sample_t or \\c retro_audio_sample_batch_t as normal.\n\n Otherwise, the frontend will discard any audio data received this frame.\n The core should skip audio rendering if possible.\n\n @note After running the frame, the audio output of the next frame\n should be no different than if audio was enabled,\n and saving and loading state should have no issues.\n This implies that the emulated console's audio pipeline state\n should not be affected by this flag."]
pub const RETRO_AV_ENABLE_AUDIO: retro_av_enable_flags = 2;
#[doc = " If set, indicates that any savestates taken this frame\n are guaranteed to be created by the same binary that will load them,\n and will not be written to or read from the disk.\n\n The core may use these guarantees to:\n\n @li Assume that loading state will succeed.\n @li Update its memory buffers in-place if possible.\n @li Skip clearing memory.\n @li Skip resetting the system.\n @li Skip validation steps.\n\n @deprecated Use \\c RETRO_ENVIRONMENT_GET_SAVESTATE_CONTEXT instead,\n except for compatibility purposes."]
pub const RETRO_AV_ENABLE_FAST_SAVESTATES: retro_av_enable_flags = 4;
#[doc = " If set, indicates that the frontend will never need audio from the core.\n Used by a frontend for implementing runahead via a secondary core instance.\n\n The core may stop synthesizing audio if it can do so\n without compromising emulation accuracy.\n\n Audio output for the next frame does not matter,\n and the frontend will never need an accurate audio state in the future.\n\n State will never be saved while this flag is set."]
pub const RETRO_AV_ENABLE_HARD_DISABLE_AUDIO: retro_av_enable_flags = 8;
#[doc = " @private Defined to ensure <tt>sizeof(retro_av_enable_flags) == sizeof(int)</tt>.\n Do not use."]
pub const RETRO_AV_ENABLE_DUMMY: retro_av_enable_flags = 2147483647;
#[doc = " Flags that define A/V steps that the core may skip for this frame.\n\n @see RETRO_ENVIRONMENT_GET_AUDIO_VIDEO_ENABLE"]
pub type retro_av_enable_flags = ::std::os::raw::c_uint;
#[doc = " @copydoc retro_midi_interface::input_enabled"]
pub type retro_midi_input_enabled_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " @copydoc retro_midi_interface::output_enabled"]
pub type retro_midi_output_enabled_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " @copydoc retro_midi_interface::read"]
pub type retro_midi_read_t = ::std::option::Option<unsafe extern "C" fn(byte: *mut u8) -> bool>;
#[doc = " @copydoc retro_midi_interface::write"]
pub type retro_midi_write_t =
    ::std::option::Option<unsafe extern "C" fn(byte: u8, delta_time: u32) -> bool>;
#[doc = " @copydoc retro_midi_interface::flush"]
pub type retro_midi_flush_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " Interface that the core can use for raw MIDI I/O."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_midi_interface {
    #[doc = " Retrieves the current state of MIDI input.\n\n @return \\c true if MIDI input is enabled."]
    pub input_enabled: retro_midi_input_enabled_t,
    #[doc = " Retrieves the current state of MIDI output.\n @return \\c true if MIDI output is enabled."]
    pub output_enabled: retro_midi_output_enabled_t,
    #[doc = " Reads a byte from the MIDI input stream.\n\n @param[out] byte The byte received from the input stream.\n @return \\c true if a byte was read,\n \\c false if MIDI input is disabled or \\c byte is \\c NULL."]
    pub read: retro_midi_read_t,
    #[doc = " Writes a byte to the output stream.\n\n @param byte The byte to write to the output stream.\n @param delta_time Time since the previous write, in microseconds.\n @return \\c true if c\\ byte was written, false otherwise."]
    pub write: retro_midi_write_t,
    #[doc = " Flushes previously-written data.\n\n @return \\c true if successful."]
    pub flush: retro_midi_flush_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_midi_interface"][::std::mem::size_of::<retro_midi_interface>() - 40usize];
    ["Alignment of retro_midi_interface"][::std::mem::align_of::<retro_midi_interface>() - 8usize];
    ["Offset of field: retro_midi_interface::input_enabled"]
        [::std::mem::offset_of!(retro_midi_interface, input_enabled) - 0usize];
    ["Offset of field: retro_midi_interface::output_enabled"]
        [::std::mem::offset_of!(retro_midi_interface, output_enabled) - 8usize];
    ["Offset of field: retro_midi_interface::read"]
        [::std::mem::offset_of!(retro_midi_interface, read) - 16usize];
    ["Offset of field: retro_midi_interface::write"]
        [::std::mem::offset_of!(retro_midi_interface, write) - 24usize];
    ["Offset of field: retro_midi_interface::flush"]
        [::std::mem::offset_of!(retro_midi_interface, flush) - 32usize];
};
#[doc = " Denotes a context negotiation interface for Vulkan.\n @see retro_hw_render_context_negotiation_interface_vulkan"]
pub const RETRO_HW_RENDER_CONTEXT_NEGOTIATION_INTERFACE_VULKAN:
    retro_hw_render_context_negotiation_interface_type = 0;
#[doc = " @private Defined to ensure <tt>sizeof(retro_hw_render_context_negotiation_interface_type) == sizeof(int)</tt>.\n Do not use."]
pub const RETRO_HW_RENDER_CONTEXT_NEGOTIATION_INTERFACE_DUMMY:
    retro_hw_render_context_negotiation_interface_type = 2147483647;
#[doc = " Describes the hardware rendering API used by\n a particular subtype of \\c retro_hw_render_context_negotiation_interface.\n\n Not every rendering API supported by libretro has a context negotiation interface,\n or even needs one.\n\n @see RETRO_ENVIRONMENT_SET_HW_RENDER_CONTEXT_NEGOTIATION_INTERFACE\n @see RETRO_ENVIRONMENT_SET_HW_RENDER\n @see RETRO_ENVIRONMENT_GET_HW_RENDER_INTERFACE"]
pub type retro_hw_render_context_negotiation_interface_type = ::std::os::raw::c_uint;
#[doc = " Base context negotiation interface type.\n All \\c retro_hw_render_context_negotiation_interface implementations\n will start with these two fields set to particular values.\n\n @see retro_hw_render_interface_type\n @see RETRO_ENVIRONMENT_SET_HW_RENDER\n @see RETRO_ENVIRONMENT_GET_HW_RENDER_INTERFACE\n @see RETRO_ENVIRONMENT_SET_HW_RENDER_CONTEXT_NEGOTIATION_INTERFACE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_hw_render_context_negotiation_interface {
    #[doc = " Denotes the particular rendering API that this interface is for.\n Each interface requires this field to be set to a particular value.\n Use it to cast this interface to the appropriate pointer."]
    pub interface_type: retro_hw_render_context_negotiation_interface_type,
    #[doc = " The version of this negotiation interface.\n @note This is not related to the version of the API itself."]
    pub interface_version: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_hw_render_context_negotiation_interface"]
        [::std::mem::size_of::<retro_hw_render_context_negotiation_interface>() - 8usize];
    ["Alignment of retro_hw_render_context_negotiation_interface"]
        [::std::mem::align_of::<retro_hw_render_context_negotiation_interface>() - 4usize];
    ["Offset of field: retro_hw_render_context_negotiation_interface::interface_type"][::std::mem::offset_of!(
        retro_hw_render_context_negotiation_interface,
        interface_type
    ) - 0usize];
    ["Offset of field: retro_hw_render_context_negotiation_interface::interface_version"][::std::mem::offset_of!(
        retro_hw_render_context_negotiation_interface,
        interface_version
    )
        - 4usize];
};
impl Default for retro_hw_render_context_negotiation_interface {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A mapping from a region of the emulated console's address space\n to the host's address space.\n\n Can be used to map an address in the console's address space\n to the host's address space, like so:\n\n @code\n void* emu_to_host(void* addr, struct retro_memory_descriptor* descriptor)\n {\n     return descriptor->ptr + (addr & ~descriptor->disconnect) - descriptor->start;\n }\n @endcode\n\n @see RETRO_ENVIRONMENT_SET_MEMORY_MAPS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_memory_descriptor {
    #[doc = " A bitwise \\c OR of one or more \\ref RETRO_MEMDESC \"flags\"\n that describe how the emulated system uses this descriptor's address range.\n\n @note If \\c ptr is \\c NULL,\n then no flags should be set.\n @see RETRO_MEMDESC"]
    pub flags: u64,
    #[doc = " Pointer to the start of this memory region's buffer\n within the \\em host's address space.\n The address listed here must be valid for the duration of the session;\n it must not be freed or modified by the frontend\n and it must not be moved by the core.\n\n May be \\c NULL to indicate a lack of accessible memory\n at the emulated address given in \\c start.\n\n @note Overlapping descriptors that include the same byte\n must have the same \\c ptr value."]
    pub ptr: *mut ::std::os::raw::c_void,
    #[doc = " The offset of this memory region,\n relative to the address given by \\c ptr.\n\n @note It is recommended to use this field for address calculations\n instead of performing arithmetic on \\c ptr."]
    pub offset: usize,
    #[doc = " The starting address of this memory region\n <em>within the emulated hardware's address space</em>.\n\n @note Not represented as a pointer\n because it's unlikely to be valid on the host device."]
    pub start: usize,
    #[doc = " A bitmask that specifies which bits of an address must match\n the bits of the \\ref start address.\n\n Combines with \\c disconnect to map an address to a memory block.\n\n If multiple memory descriptors can claim a particular byte,\n the first one defined in the \\ref retro_memory_descriptor array applies.\n A bit which is set in \\c start must also be set in this.\n\n Can be zero, in which case \\c start and \\c len represent\n the complete mapping for this region of memory\n (i.e. each byte is mapped exactly once).\n In this case, \\c len must be a power of two."]
    pub select: usize,
    #[doc = " A bitmask of bits that are \\em not used for addressing.\n\n Any set bits are assumed to be disconnected from\n the emulated memory chip's address pins,\n and are therefore ignored when memory-mapping."]
    pub disconnect: usize,
    #[doc = " The length of this memory region, in bytes.\n\n If applying \\ref start and \\ref disconnect to an address\n results in a value higher than this,\n the highest bit of the address is cleared.\n\n If the address is still too high, the next highest bit is cleared.\n Can be zero, in which case it's assumed to be\n bounded only by \\ref select and \\ref disconnect."]
    pub len: usize,
    #[doc = " A short name for this address space.\n\n Names must meet the following requirements:\n\n \\li Characters must be in the set <tt>[a-zA-Z0-9_-]</tt>.\n \\li No more than 8 characters, plus a \\c NULL terminator.\n \\li Names are case-sensitive, but lowercase characters are discouraged.\n \\li A name must not be the same as another name plus a character in the set \\c [A-F0-9]\n     (i.e. if an address space named \"RAM\" exists,\n     then the names \"RAM0\", \"RAM1\", ..., \"RAMF\" are forbidden).\n     This is to allow addresses to be named by each descriptor unambiguously,\n     even if the areas overlap.\n \\li May be \\c NULL or empty (both are considered equivalent).\n\n Here are some examples of pairs of address space names:\n\n \\li \\em blank + \\em blank: valid (multiple things may be mapped in the same namespace)\n \\li \\c Sp + \\c Sp: valid (multiple things may be mapped in the same namespace)\n \\li \\c SRAM + \\c VRAM: valid (neither is a prefix of the other)\n \\li \\c V + \\em blank: valid (\\c V is not in \\c [A-F0-9])\n \\li \\c a + \\em blank: valid but discouraged (\\c a is not in \\c [A-F0-9])\n \\li \\c a + \\c A: valid but discouraged (neither is a prefix of the other)\n \\li \\c AR + \\em blank: valid (\\c R is not in \\c [A-F0-9])\n \\li \\c ARB + \\em blank: valid (there's no \\c AR namespace,\n     so the \\c B doesn't cause ambiguity).\n \\li \\em blank + \\c B: invalid, because it's ambiguous which address space \\c B1234 would refer to.\n\n The length of the address space's name can't be used to disambugiate,\n as extra information may be appended to it without a separator."]
    pub addrspace: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_memory_descriptor"][::std::mem::size_of::<retro_memory_descriptor>() - 64usize];
    ["Alignment of retro_memory_descriptor"]
        [::std::mem::align_of::<retro_memory_descriptor>() - 8usize];
    ["Offset of field: retro_memory_descriptor::flags"]
        [::std::mem::offset_of!(retro_memory_descriptor, flags) - 0usize];
    ["Offset of field: retro_memory_descriptor::ptr"]
        [::std::mem::offset_of!(retro_memory_descriptor, ptr) - 8usize];
    ["Offset of field: retro_memory_descriptor::offset"]
        [::std::mem::offset_of!(retro_memory_descriptor, offset) - 16usize];
    ["Offset of field: retro_memory_descriptor::start"]
        [::std::mem::offset_of!(retro_memory_descriptor, start) - 24usize];
    ["Offset of field: retro_memory_descriptor::select"]
        [::std::mem::offset_of!(retro_memory_descriptor, select) - 32usize];
    ["Offset of field: retro_memory_descriptor::disconnect"]
        [::std::mem::offset_of!(retro_memory_descriptor, disconnect) - 40usize];
    ["Offset of field: retro_memory_descriptor::len"]
        [::std::mem::offset_of!(retro_memory_descriptor, len) - 48usize];
    ["Offset of field: retro_memory_descriptor::addrspace"]
        [::std::mem::offset_of!(retro_memory_descriptor, addrspace) - 56usize];
};
impl Default for retro_memory_descriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A list of regions within the emulated console's address space.\n\n The frontend may use the largest value of\n \\ref retro_memory_descriptor::start + \\ref retro_memory_descriptor::select\n in a certain namespace to infer the overall size of the address space.\n If the address space is larger than that,\n the last mapping in \\ref descriptors should have \\ref retro_memory_descriptor::ptr set to \\c NULL\n and \\ref retro_memory_descriptor::select should have all bits used in the address space set to 1.\n\n Here's an example set of descriptors for the SNES.\n\n @code{.c}\n struct retro_memory_map snes_descriptors = retro_memory_map\n {\n    .descriptors = (struct retro_memory_descriptor[])\n    {\n       // WRAM; must usually be mapped before the ROM,\n       // as some SNES ROM mappers try to claim 0x7E0000\n       { .addrspace=\"WRAM\", .start=0x7E0000, .len=0x20000 },\n\n       // SPC700 RAM\n       { .addrspace=\"SPC700\", .len=0x10000 },\n\n       // WRAM mirrors\n       { .addrspace=\"WRAM\", .start=0x000000, .select=0xC0E000, .len=0x2000 },\n       { .addrspace=\"WRAM\", .start=0x800000, .select=0xC0E000, .len=0x2000 },\n\n       // WRAM mirror, alternate equivalent descriptor\n       // (Various similar constructions can be created by combining parts of the above two.)\n       { .addrspace=\"WRAM\", .select=0x40E000, .disconnect=~0x1FFF },\n\n       // LoROM (512KB, mirrored a couple of times)\n       { .addrspace=\"LoROM\", .start=0x008000, .select=0x408000, .disconnect=0x8000, .len=512*1024, .flags=RETRO_MEMDESC_CONST },\n       { .addrspace=\"LoROM\", .start=0x400000, .select=0x400000, .disconnect=0x8000, .len=512*1024, .flags=RETRO_MEMDESC_CONST },\n\n       // HiROM (4MB)\n       { .addrspace=\"HiROM\", .start=0x400000, .select=0x400000, .len=4*1024*1024, .flags=RETRO_MEMDESC_CONST },\n       { .addrspace=\"HiROM\", .start=0x008000, .select=0x408000, .len=4*1024*1024, .offset=0x8000, .flags=RETRO_MEMDESC_CONST },\n\n       // ExHiROM (8MB)\n       { .addrspace=\"ExHiROM\", .start=0xC00000, .select=0xC00000, .len=4*1024*1024, .offset=0, .flags=RETRO_MEMDESC_CONST },\n       { .addrspace=\"ExHiROM\", .start=0x400000, .select=0xC00000, .len=4*1024*1024, .offset=4*1024*1024, .flags=RETRO_MEMDESC_CONST },\n       { .addrspace=\"ExHiROM\", .start=0x808000, .select=0xC08000, .len=4*1024*1024, .offset=0x8000, .flags=RETRO_MEMDESC_CONST },\n       { .addrspace=\"ExHiROM\", .start=0x008000, .select=0xC08000, .len=4*1024*1024, .offset=4*1024*1024+0x8000, .flags=RETRO_MEMDESC_CONST },\n\n       // Clarifying the full size of the address space\n       { .select=0xFFFFFF, .ptr=NULL },\n    },\n    .num_descriptors = 14,\n };\n @endcode\n\n @see RETRO_ENVIRONMENT_SET_MEMORY_MAPS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_memory_map {
    #[doc = " Pointer to an array of memory descriptors,\n each of which describes part of the emulated console's address space."]
    pub descriptors: *const retro_memory_descriptor,
    #[doc = " The number of descriptors in \\c descriptors."]
    pub num_descriptors: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_memory_map"][::std::mem::size_of::<retro_memory_map>() - 16usize];
    ["Alignment of retro_memory_map"][::std::mem::align_of::<retro_memory_map>() - 8usize];
    ["Offset of field: retro_memory_map::descriptors"]
        [::std::mem::offset_of!(retro_memory_map, descriptors) - 0usize];
    ["Offset of field: retro_memory_map::num_descriptors"]
        [::std::mem::offset_of!(retro_memory_map, num_descriptors) - 8usize];
};
impl Default for retro_memory_map {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Details about a controller (or controller configuration)\n supported by one of a core's emulated input ports.\n\n @see RETRO_ENVIRONMENT_SET_CONTROLLER_INFO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_controller_description {
    #[doc = " A human-readable label for the controller or configuration\n represented by this device type.\n Most likely the device's original brand name."]
    pub desc: *const ::std::os::raw::c_char,
    #[doc = " A unique identifier that will be passed to \\c retro_set_controller_port_device()'s \\c device parameter.\n May be the ID of one of \\ref RETRO_DEVICE \"the generic controller types\",\n or a subclass ID defined with \\c RETRO_DEVICE_SUBCLASS.\n\n @see RETRO_DEVICE_SUBCLASS"]
    pub id: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_controller_description"]
        [::std::mem::size_of::<retro_controller_description>() - 16usize];
    ["Alignment of retro_controller_description"]
        [::std::mem::align_of::<retro_controller_description>() - 8usize];
    ["Offset of field: retro_controller_description::desc"]
        [::std::mem::offset_of!(retro_controller_description, desc) - 0usize];
    ["Offset of field: retro_controller_description::id"]
        [::std::mem::offset_of!(retro_controller_description, id) - 8usize];
};
impl Default for retro_controller_description {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Lists the types of controllers supported by\n one of core's emulated input ports.\n\n @see RETRO_ENVIRONMENT_SET_CONTROLLER_INFO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_controller_info {
    #[doc = " A pointer to an array of device types supported by this controller port.\n\n @note Ports that support the same devices\n may share the same underlying array."]
    pub types: *const retro_controller_description,
    #[doc = " The number of elements in \\c types."]
    pub num_types: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_controller_info"][::std::mem::size_of::<retro_controller_info>() - 16usize];
    ["Alignment of retro_controller_info"]
        [::std::mem::align_of::<retro_controller_info>() - 8usize];
    ["Offset of field: retro_controller_info::types"]
        [::std::mem::offset_of!(retro_controller_info, types) - 0usize];
    ["Offset of field: retro_controller_info::num_types"]
        [::std::mem::offset_of!(retro_controller_info, num_types) - 8usize];
};
impl Default for retro_controller_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Information about a type of memory associated with a subsystem.\n Usually used for SRAM (save RAM).\n\n @see RETRO_ENVIRONMENT_SET_SUBSYSTEM_INFO\n @see retro_get_memory_data\n @see retro_get_memory_size"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_subsystem_memory_info {
    #[doc = " The file extension the frontend should use\n to save this memory region to disk, e.g. \"srm\" or \"sav\"."]
    pub extension: *const ::std::os::raw::c_char,
    #[doc = " A constant that identifies this type of memory.\n Should be at least 0x100 (256) to avoid conflict\n with the standard libretro memory types,\n unless a subsystem uses the main platform's memory region.\n @see RETRO_MEMORY"]
    pub type_: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_subsystem_memory_info"]
        [::std::mem::size_of::<retro_subsystem_memory_info>() - 16usize];
    ["Alignment of retro_subsystem_memory_info"]
        [::std::mem::align_of::<retro_subsystem_memory_info>() - 8usize];
    ["Offset of field: retro_subsystem_memory_info::extension"]
        [::std::mem::offset_of!(retro_subsystem_memory_info, extension) - 0usize];
    ["Offset of field: retro_subsystem_memory_info::type_"]
        [::std::mem::offset_of!(retro_subsystem_memory_info, type_) - 8usize];
};
impl Default for retro_subsystem_memory_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Information about a type of ROM that a subsystem may use.\n Subsystems may use one or more ROMs at once,\n possibly of different types.\n\n @see RETRO_ENVIRONMENT_SET_SUBSYSTEM_INFO\n @see retro_subsystem_info"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_subsystem_rom_info {
    #[doc = " Human-readable description of what the content represents,\n e.g. \"Game Boy ROM\"."]
    pub desc: *const ::std::os::raw::c_char,
    #[doc = " @copydoc retro_system_info::valid_extensions"]
    pub valid_extensions: *const ::std::os::raw::c_char,
    #[doc = " @copydoc retro_system_info::need_fullpath"]
    pub need_fullpath: bool,
    #[doc = " @copydoc retro_system_info::block_extract"]
    pub block_extract: bool,
    #[doc = " Indicates whether this particular subsystem ROM is required.\n If \\c true and the user doesn't provide a ROM,\n the frontend should not load the core.\n If \\c false and the user doesn't provide a ROM,\n the frontend should pass a zeroed-out \\c retro_game_info\n to the corresponding entry in \\c retro_load_game_special()."]
    pub required: bool,
    #[doc = " Pointer to an array of memory descriptors that this subsystem ROM type uses.\n Useful for secondary cartridges that have their own save data.\n May be \\c NULL, in which case this subsystem ROM's memory is not persisted by the frontend\n and \\c num_memory should be zero."]
    pub memory: *const retro_subsystem_memory_info,
    #[doc = " The number of elements in the array pointed to by \\c memory."]
    pub num_memory: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_subsystem_rom_info"]
        [::std::mem::size_of::<retro_subsystem_rom_info>() - 40usize];
    ["Alignment of retro_subsystem_rom_info"]
        [::std::mem::align_of::<retro_subsystem_rom_info>() - 8usize];
    ["Offset of field: retro_subsystem_rom_info::desc"]
        [::std::mem::offset_of!(retro_subsystem_rom_info, desc) - 0usize];
    ["Offset of field: retro_subsystem_rom_info::valid_extensions"]
        [::std::mem::offset_of!(retro_subsystem_rom_info, valid_extensions) - 8usize];
    ["Offset of field: retro_subsystem_rom_info::need_fullpath"]
        [::std::mem::offset_of!(retro_subsystem_rom_info, need_fullpath) - 16usize];
    ["Offset of field: retro_subsystem_rom_info::block_extract"]
        [::std::mem::offset_of!(retro_subsystem_rom_info, block_extract) - 17usize];
    ["Offset of field: retro_subsystem_rom_info::required"]
        [::std::mem::offset_of!(retro_subsystem_rom_info, required) - 18usize];
    ["Offset of field: retro_subsystem_rom_info::memory"]
        [::std::mem::offset_of!(retro_subsystem_rom_info, memory) - 24usize];
    ["Offset of field: retro_subsystem_rom_info::num_memory"]
        [::std::mem::offset_of!(retro_subsystem_rom_info, num_memory) - 32usize];
};
impl Default for retro_subsystem_rom_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Information about a secondary platform that a core supports.\n @see RETRO_ENVIRONMENT_SET_SUBSYSTEM_INFO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_subsystem_info {
    #[doc = " A human-readable description of the subsystem type,\n usually the brand name of the original platform\n (e.g. \"Super Game Boy\")."]
    pub desc: *const ::std::os::raw::c_char,
    #[doc = " A short machine-friendly identifier for the subsystem,\n usually an abbreviation of the platform name.\n For example, a Super Game Boy subsystem for a SNES core\n might use an identifier of \"sgb\".\n This identifier can be used for command-line interfaces,\n configuration, or other purposes.\n Must use lower-case alphabetical characters only (i.e. from a-z)."]
    pub ident: *const ::std::os::raw::c_char,
    #[doc = " The list of ROM types that this subsystem may use.\n\n The first entry is considered to be the \"most significant\" content,\n for the purposes of the frontend's categorization.\n E.g. with Super GameBoy, the first content should be the GameBoy ROM,\n as it is the most \"significant\" content to a user.\n\n If a frontend creates new files based on the content used (e.g. for savestates),\n it should derive the filenames from the name of the first ROM in this list.\n\n @note \\c roms can have a single element,\n but this is usually a sign that the core should broaden its\n primary system info instead.\n\n @see \\c retro_system_info"]
    pub roms: *const retro_subsystem_rom_info,
    #[doc = " The length of the array given in \\c roms."]
    pub num_roms: ::std::os::raw::c_uint,
    #[doc = " A unique identifier passed to retro_load_game_special()."]
    pub id: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_subsystem_info"][::std::mem::size_of::<retro_subsystem_info>() - 32usize];
    ["Alignment of retro_subsystem_info"][::std::mem::align_of::<retro_subsystem_info>() - 8usize];
    ["Offset of field: retro_subsystem_info::desc"]
        [::std::mem::offset_of!(retro_subsystem_info, desc) - 0usize];
    ["Offset of field: retro_subsystem_info::ident"]
        [::std::mem::offset_of!(retro_subsystem_info, ident) - 8usize];
    ["Offset of field: retro_subsystem_info::roms"]
        [::std::mem::offset_of!(retro_subsystem_info, roms) - 16usize];
    ["Offset of field: retro_subsystem_info::num_roms"]
        [::std::mem::offset_of!(retro_subsystem_info, num_roms) - 24usize];
    ["Offset of field: retro_subsystem_info::id"]
        [::std::mem::offset_of!(retro_subsystem_info, id) - 28usize];
};
impl Default for retro_subsystem_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " The function pointer type that \\c retro_get_proc_address_t returns.\n\n Despite the signature shown here, the original function may include any parameters and return type\n that respects the calling convention and C ABI.\n\n The frontend is expected to cast the function pointer to the correct type."]
pub type retro_proc_address_t = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " Get a symbol from a libretro core.\n\n Cores should only return symbols that serve as libretro extensions.\n Frontends should not use this to obtain symbols to standard libretro entry points;\n instead, they should link to the core statically or use \\c dlsym (or local equivalent).\n\n The symbol name must be equal to the function name.\n e.g. if <tt>void retro_foo(void);</tt> exists, the symbol in the compiled library must be called \\c retro_foo.\n The returned function pointer must be cast to the corresponding type.\n\n @param \\c sym The name of the symbol to look up.\n @return Pointer to the exposed function with the name given in \\c sym,\n or \\c NULL if one couldn't be found.\n @note The frontend is expected to know the returned pointer's type in advance\n so that it can be cast correctly.\n @note The core doesn't need to expose every possible function through this interface.\n It's enough to only expose the ones that it expects the frontend to use.\n @note The functions exposed through this interface\n don't need to be publicly exposed in the compiled library\n (e.g. via \\c __declspec(dllexport)).\n @see RETRO_ENVIRONMENT_SET_PROC_ADDRESS_CALLBACK"]
pub type retro_get_proc_address_t = ::std::option::Option<
    unsafe extern "C" fn(sym: *const ::std::os::raw::c_char) -> retro_proc_address_t,
>;
#[doc = " An interface that the frontend can use to get function pointers from the core.\n\n @note The returned function pointer will be invalidated once the core is unloaded.\n How and when that happens is up to the frontend.\n\n @see retro_get_proc_address_t\n @see RETRO_ENVIRONMENT_SET_PROC_ADDRESS_CALLBACK"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_get_proc_address_interface {
    #[doc = " Set by the core."]
    pub get_proc_address: retro_get_proc_address_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_get_proc_address_interface"]
        [::std::mem::size_of::<retro_get_proc_address_interface>() - 8usize];
    ["Alignment of retro_get_proc_address_interface"]
        [::std::mem::align_of::<retro_get_proc_address_interface>() - 8usize];
    ["Offset of field: retro_get_proc_address_interface::get_proc_address"]
        [::std::mem::offset_of!(retro_get_proc_address_interface, get_proc_address) - 0usize];
};
#[doc = " The logged message is most likely not interesting to the user."]
pub const RETRO_LOG_DEBUG: retro_log_level = 0;
#[doc = " Information about the core operating normally."]
pub const RETRO_LOG_INFO: retro_log_level = 1;
#[doc = " Indicates a potential problem, possibly one that the core can recover from."]
pub const RETRO_LOG_WARN: retro_log_level = 2;
#[doc = " Indicates a degraded experience, if not failure."]
pub const RETRO_LOG_ERROR: retro_log_level = 3;
#[doc = " Defined to ensure that sizeof(enum retro_log_level) == sizeof(int). Do not use."]
pub const RETRO_LOG_DUMMY: retro_log_level = 2147483647;
#[doc = " The severity of a given message.\n The frontend may log messages differently depending on the level.\n It may also ignore log messages of a certain level.\n @see retro_log_callback"]
pub type retro_log_level = ::std::os::raw::c_uint;
#[doc = " Logs a message to the frontend.\n\n @param level The log level of the message.\n @param fmt The format string to log.\n Same format as \\c printf.\n Behavior is undefined if this is \\c NULL.\n @param ... Zero or more arguments used by the format string.\n Behavior is undefined if these don't match the ones expected by \\c fmt.\n @see retro_log_level\n @see retro_log_callback\n @see RETRO_ENVIRONMENT_GET_LOG_INTERFACE\n @see printf"]
pub type retro_log_printf_t = ::std::option::Option<
    unsafe extern "C" fn(level: retro_log_level, fmt: *const ::std::os::raw::c_char, ...),
>;
#[doc = " Details about how to make log messages.\n\n @see retro_log_printf_t\n @see RETRO_ENVIRONMENT_GET_LOG_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_log_callback {
    #[doc = " Called when logging a message.\n\n @note Set by the frontend."]
    pub log: retro_log_printf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_log_callback"][::std::mem::size_of::<retro_log_callback>() - 8usize];
    ["Alignment of retro_log_callback"][::std::mem::align_of::<retro_log_callback>() - 8usize];
    ["Offset of field: retro_log_callback::log"]
        [::std::mem::offset_of!(retro_log_callback, log) - 0usize];
};
#[doc = " An abstract unit of ticks.\n\n Usually nanoseconds or CPU cycles,\n but it depends on the platform and the frontend."]
pub type retro_perf_tick_t = u64;
#[doc = " Time in microseconds."]
pub type retro_time_t = i64;
#[doc = " A performance counter.\n\n Use this to measure the execution time of a region of code.\n @see retro_perf_callback"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_perf_counter {
    #[doc = " A human-readable identifier for the counter.\n\n May be displayed by the frontend.\n Behavior is undefined if this is \\c NULL."]
    pub ident: *const ::std::os::raw::c_char,
    #[doc = " The time of the most recent call to \\c retro_perf_callback::perf_start\n on this performance counter.\n\n @see retro_perf_start_t"]
    pub start: retro_perf_tick_t,
    #[doc = " The total time spent within this performance counter's measured code,\n i.e. between calls to \\c retro_perf_callback::perf_start and \\c retro_perf_callback::perf_stop.\n\n Updated after each call to \\c retro_perf_callback::perf_stop.\n @see retro_perf_stop_t"]
    pub total: retro_perf_tick_t,
    #[doc = " The number of times this performance counter has been started.\n\n Updated after each call to \\c retro_perf_callback::perf_start.\n @see retro_perf_start_t"]
    pub call_cnt: retro_perf_tick_t,
    #[doc = " \\c true if this performance counter has been registered by the frontend.\n Must be initialized to \\c false by the core before registering it.\n @see retro_perf_register_t"]
    pub registered: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_perf_counter"][::std::mem::size_of::<retro_perf_counter>() - 40usize];
    ["Alignment of retro_perf_counter"][::std::mem::align_of::<retro_perf_counter>() - 8usize];
    ["Offset of field: retro_perf_counter::ident"]
        [::std::mem::offset_of!(retro_perf_counter, ident) - 0usize];
    ["Offset of field: retro_perf_counter::start"]
        [::std::mem::offset_of!(retro_perf_counter, start) - 8usize];
    ["Offset of field: retro_perf_counter::total"]
        [::std::mem::offset_of!(retro_perf_counter, total) - 16usize];
    ["Offset of field: retro_perf_counter::call_cnt"]
        [::std::mem::offset_of!(retro_perf_counter, call_cnt) - 24usize];
    ["Offset of field: retro_perf_counter::registered"]
        [::std::mem::offset_of!(retro_perf_counter, registered) - 32usize];
};
impl Default for retro_perf_counter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @returns The current system time in microseconds.\n @note Accuracy may vary by platform.\n The frontend should use the most accurate timer possible.\n @see RETRO_ENVIRONMENT_GET_PERF_INTERFACE"]
pub type retro_perf_get_time_usec_t = ::std::option::Option<unsafe extern "C" fn() -> retro_time_t>;
#[doc = " @returns The number of ticks since some unspecified epoch.\n The exact meaning of a \"tick\" depends on the platform,\n but it usually refers to nanoseconds or CPU cycles.\n @see RETRO_ENVIRONMENT_GET_PERF_INTERFACE"]
pub type retro_perf_get_counter_t =
    ::std::option::Option<unsafe extern "C" fn() -> retro_perf_tick_t>;
#[doc = " Returns a bitmask of detected CPU features.\n\n Use this for runtime dispatching of CPU-specific code.\n\n @returns A bitmask of detected CPU features.\n @see RETRO_ENVIRONMENT_GET_PERF_INTERFACE\n @see RETRO_SIMD"]
pub type retro_get_cpu_features_t = ::std::option::Option<unsafe extern "C" fn() -> u64>;
#[doc = " Asks the frontend to log or display the state of performance counters.\n How this is done depends on the frontend.\n Performance counters can be reviewed manually as well.\n\n @see RETRO_ENVIRONMENT_GET_PERF_INTERFACE\n @see retro_perf_counter"]
pub type retro_perf_log_t = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " Registers a new performance counter.\n\n If \\c counter has already been registered beforehand,\n this function does nothing.\n\n @param counter The counter to register.\n \\c counter::ident must be set to a unique identifier,\n and all other values in \\c counter must be set to zero or \\c false.\n Behavior is undefined if \\c NULL.\n @post If \\c counter is successfully registered,\n then \\c counter::registered will be set to \\c true.\n Otherwise, it will be set to \\c false.\n Registration may fail if the frontend's maximum number of counters (if any) has been reached.\n @note The counter is owned by the core and must not be freed by the frontend.\n The frontend must also clean up any references to a core's performance counters\n before unloading it, otherwise undefined behavior may occur.\n @see retro_perf_start_t\n @see retro_perf_stop_t"]
pub type retro_perf_register_t =
    ::std::option::Option<unsafe extern "C" fn(counter: *mut retro_perf_counter)>;
#[doc = " Starts a registered performance counter.\n\n Call this just before the code you want to measure.\n\n @param counter The counter to start.\n Behavior is undefined if \\c NULL.\n @see retro_perf_stop_t"]
pub type retro_perf_start_t =
    ::std::option::Option<unsafe extern "C" fn(counter: *mut retro_perf_counter)>;
#[doc = " Stops a registered performance counter.\n\n Call this just after the code you want to measure.\n\n @param counter The counter to stop.\n Behavior is undefined if \\c NULL.\n @see retro_perf_start_t\n @see retro_perf_stop_t"]
pub type retro_perf_stop_t =
    ::std::option::Option<unsafe extern "C" fn(counter: *mut retro_perf_counter)>;
#[doc = " An interface that the core can use to get performance information.\n\n Here's a usage example:\n\n @code{.c}\n #ifdef PROFILING\n // Wrapper macros to simplify using performance counters.\n // Optional; tailor these to your project's needs.\n #define RETRO_PERFORMANCE_INIT(perf_cb, name) static struct retro_perf_counter name = {#name}; if (!name.registered) perf_cb.perf_register(&(name))\n #define RETRO_PERFORMANCE_START(perf_cb, name) perf_cb.perf_start(&(name))\n #define RETRO_PERFORMANCE_STOP(perf_cb, name) perf_cb.perf_stop(&(name))\n #else\n // Exclude the performance counters if profiling is disabled.\n #define RETRO_PERFORMANCE_INIT(perf_cb, name) ((void)0)\n #define RETRO_PERFORMANCE_START(perf_cb, name) ((void)0)\n #define RETRO_PERFORMANCE_STOP(perf_cb, name) ((void)0)\n #endif\n\n // Defined somewhere else in the core.\n extern struct retro_perf_callback perf_cb;\n\n void retro_run(void)\n {\n    RETRO_PERFORMANCE_INIT(cb, interesting);\n    RETRO_PERFORMANCE_START(cb, interesting);\n    interesting_work();\n    RETRO_PERFORMANCE_STOP(cb, interesting);\n\n    RETRO_PERFORMANCE_INIT(cb, maybe_slow);\n    RETRO_PERFORMANCE_START(cb, maybe_slow);\n    more_interesting_work();\n    RETRO_PERFORMANCE_STOP(cb, maybe_slow);\n }\n\n void retro_deinit(void)\n {\n    // Asks the frontend to log the results of all performance counters.\n    perf_cb.perf_log();\n }\n @endcode\n\n All functions are set by the frontend.\n\n @see RETRO_ENVIRONMENT_GET_PERF_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_perf_callback {
    #[doc = " @copydoc retro_perf_get_time_usec_t"]
    pub get_time_usec: retro_perf_get_time_usec_t,
    #[doc = " @copydoc retro_perf_get_counter_t"]
    pub get_cpu_features: retro_get_cpu_features_t,
    #[doc = " @copydoc retro_perf_get_counter_t"]
    pub get_perf_counter: retro_perf_get_counter_t,
    #[doc = " @copydoc retro_perf_register_t"]
    pub perf_register: retro_perf_register_t,
    #[doc = " @copydoc retro_perf_start_t"]
    pub perf_start: retro_perf_start_t,
    #[doc = " @copydoc retro_perf_stop_t"]
    pub perf_stop: retro_perf_stop_t,
    #[doc = " @copydoc retro_perf_log_t"]
    pub perf_log: retro_perf_log_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_perf_callback"][::std::mem::size_of::<retro_perf_callback>() - 56usize];
    ["Alignment of retro_perf_callback"][::std::mem::align_of::<retro_perf_callback>() - 8usize];
    ["Offset of field: retro_perf_callback::get_time_usec"]
        [::std::mem::offset_of!(retro_perf_callback, get_time_usec) - 0usize];
    ["Offset of field: retro_perf_callback::get_cpu_features"]
        [::std::mem::offset_of!(retro_perf_callback, get_cpu_features) - 8usize];
    ["Offset of field: retro_perf_callback::get_perf_counter"]
        [::std::mem::offset_of!(retro_perf_callback, get_perf_counter) - 16usize];
    ["Offset of field: retro_perf_callback::perf_register"]
        [::std::mem::offset_of!(retro_perf_callback, perf_register) - 24usize];
    ["Offset of field: retro_perf_callback::perf_start"]
        [::std::mem::offset_of!(retro_perf_callback, perf_start) - 32usize];
    ["Offset of field: retro_perf_callback::perf_stop"]
        [::std::mem::offset_of!(retro_perf_callback, perf_stop) - 40usize];
    ["Offset of field: retro_perf_callback::perf_log"]
        [::std::mem::offset_of!(retro_perf_callback, perf_log) - 48usize];
};
#[doc = " Enables accelerometer input, if one exists."]
pub const RETRO_SENSOR_ACCELEROMETER_ENABLE: retro_sensor_action = 0;
#[doc = " Disables accelerometer input, if one exists."]
pub const RETRO_SENSOR_ACCELEROMETER_DISABLE: retro_sensor_action = 1;
#[doc = " Enables gyroscope input, if one exists."]
pub const RETRO_SENSOR_GYROSCOPE_ENABLE: retro_sensor_action = 2;
#[doc = " Disables gyroscope input, if one exists."]
pub const RETRO_SENSOR_GYROSCOPE_DISABLE: retro_sensor_action = 3;
#[doc = " Enables ambient light input, if a luminance sensor exists."]
pub const RETRO_SENSOR_ILLUMINANCE_ENABLE: retro_sensor_action = 4;
#[doc = " Disables ambient light input, if a luminance sensor exists."]
pub const RETRO_SENSOR_ILLUMINANCE_DISABLE: retro_sensor_action = 5;
#[doc = " @private Defined to ensure <tt>sizeof(enum retro_sensor_action) == sizeof(int)</tt>. Do not use."]
pub const RETRO_SENSOR_DUMMY: retro_sensor_action = 2147483647;
#[doc = " Defines actions that can be performed on sensors.\n @note Cores should only enable sensors while they're actively being used;\n depending on the frontend and platform,\n enabling these sensors may impact battery life.\n\n @see RETRO_ENVIRONMENT_GET_SENSOR_INTERFACE\n @see retro_sensor_interface\n @see retro_set_sensor_state_t"]
pub type retro_sensor_action = ::std::os::raw::c_uint;
#[doc = " Adjusts the state of a sensor.\n\n @param port The device port of the controller that owns the sensor given in \\c action.\n @param action The action to perform on the sensor.\n Different devices support different sensors.\n @param rate The rate at which the underlying sensor should be updated, in Hz.\n This should be treated as a hint,\n as some device sensors may not support the requested rate\n (if it's configurable at all).\n @returns \\c true if the sensor state was successfully adjusted, \\c false otherwise.\n @note If one of the \\c RETRO_SENSOR_*_ENABLE actions fails,\n this likely means that the given sensor is not available\n on the provided \\c port.\n @see retro_sensor_action"]
pub type retro_set_sensor_state_t = ::std::option::Option<
    unsafe extern "C" fn(
        port: ::std::os::raw::c_uint,
        action: retro_sensor_action,
        rate: ::std::os::raw::c_uint,
    ) -> bool,
>;
#[doc = " Retrieves the current value reported by sensor.\n @param port The device port of the controller that owns the sensor given in \\c id.\n @param id The sensor value to query.\n @returns The current sensor value.\n Exact semantics depend on the value given in \\c id,\n but will return 0 for invalid arguments.\n\n @see RETRO_SENSOR_ID"]
pub type retro_sensor_get_input_t = ::std::option::Option<
    unsafe extern "C" fn(port: ::std::os::raw::c_uint, id: ::std::os::raw::c_uint) -> f32,
>;
#[doc = " An interface that cores can use to access device sensors.\n\n All function pointers are set by the frontend."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_sensor_interface {
    #[doc = " @copydoc retro_set_sensor_state_t"]
    pub set_sensor_state: retro_set_sensor_state_t,
    #[doc = " @copydoc retro_sensor_get_input_t"]
    pub get_sensor_input: retro_sensor_get_input_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_sensor_interface"][::std::mem::size_of::<retro_sensor_interface>() - 16usize];
    ["Alignment of retro_sensor_interface"]
        [::std::mem::align_of::<retro_sensor_interface>() - 8usize];
    ["Offset of field: retro_sensor_interface::set_sensor_state"]
        [::std::mem::offset_of!(retro_sensor_interface, set_sensor_state) - 0usize];
    ["Offset of field: retro_sensor_interface::get_sensor_input"]
        [::std::mem::offset_of!(retro_sensor_interface, get_sensor_input) - 8usize];
};
#[doc = " Indicates that camera frames should be delivered to the core as an OpenGL texture.\n\n Requires that the core is using an OpenGL context via \\c RETRO_ENVIRONMENT_SET_HW_RENDER.\n\n @see retro_camera_frame_opengl_texture_t"]
pub const RETRO_CAMERA_BUFFER_OPENGL_TEXTURE: retro_camera_buffer = 0;
#[doc = " Indicates that camera frames should be delivered to the core as a raw buffer in memory.\n\n @see retro_camera_frame_raw_framebuffer_t"]
pub const RETRO_CAMERA_BUFFER_RAW_FRAMEBUFFER: retro_camera_buffer = 1;
#[doc = " @private Defined to ensure <tt>sizeof(enum retro_camera_buffer) == sizeof(int)</tt>.\n Do not use."]
pub const RETRO_CAMERA_BUFFER_DUMMY: retro_camera_buffer = 2147483647;
#[doc = " Denotes the type of buffer in which the camera will store its input.\n\n Different camera drivers may support different buffer types.\n\n @see RETRO_ENVIRONMENT_GET_CAMERA_INTERFACE\n @see retro_camera_callback"]
pub type retro_camera_buffer = ::std::os::raw::c_uint;
#[doc = " Starts an initialized camera.\n The camera is disabled by default,\n and must be enabled with this function before being used.\n\n Set by the frontend.\n\n @returns \\c true if the camera was successfully started, \\c false otherwise.\n Failure may occur if no actual camera is available,\n or if the frontend doesn't have permission to access it.\n @note Must be called in \\c retro_run().\n @see retro_camera_callback"]
pub type retro_camera_start_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " Stops the running camera.\n\n Set by the frontend.\n\n @note Must be called in \\c retro_run().\n @warning The frontend may close the camera on its own when unloading the core,\n but this behavior is not guaranteed.\n Cores should clean up the camera before exiting.\n @see retro_camera_callback"]
pub type retro_camera_stop_t = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " Called by the frontend to report the state of the camera driver.\n\n @see retro_camera_callback"]
pub type retro_camera_lifetime_status_t = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " Called by the frontend to report a new camera frame,\n delivered as a raw buffer in memory.\n\n Set by the core.\n\n @param buffer Pointer to the camera's most recent video frame.\n Each pixel is in XRGB8888 format.\n The first pixel represents the top-left corner of the image\n (i.e. the Y axis goes downward).\n @param width The width of the frame given in \\c buffer, in pixels.\n @param height The height of the frame given in \\c buffer, in pixels.\n @param pitch The width of the frame given in \\c buffer, in bytes.\n @warning \\c buffer may be invalidated when this function returns,\n so the core should make its own copy of \\c buffer if necessary.\n @see RETRO_CAMERA_BUFFER_RAW_FRAMEBUFFER"]
pub type retro_camera_frame_raw_framebuffer_t = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *const u32,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
        pitch: usize,
    ),
>;
#[doc = " Called by the frontend to report a new camera frame,\n delivered as an OpenGL texture.\n\n @param texture_id The ID of the OpenGL texture that represents the camera's most recent frame.\n Owned by the frontend, and must not be modified by the core.\n @param texture_target The type of the texture given in \\c texture_id.\n Usually either \\c GL_TEXTURE_2D or \\c GL_TEXTURE_RECTANGLE,\n but other types are allowed.\n @param affine A pointer to a 3x3 column-major affine matrix\n that can be used to transform pixel coordinates to texture coordinates.\n After transformation, the bottom-left corner should have coordinates of <tt>(0, 0)</tt>\n and the top-right corner should have coordinates of <tt>(1, 1)</tt>\n (or <tt>(width, height)</tt> for \\c GL_TEXTURE_RECTANGLE).\n\n @note GL-specific typedefs (e.g. \\c GLfloat and \\c GLuint) are avoided here\n so that the API doesn't rely on gl.h.\n @warning \\c texture_id and \\c affine may be invalidated when this function returns,\n so the core should make its own copy of them if necessary."]
pub type retro_camera_frame_opengl_texture_t = ::std::option::Option<
    unsafe extern "C" fn(
        texture_id: ::std::os::raw::c_uint,
        texture_target: ::std::os::raw::c_uint,
        affine: *const f32,
    ),
>;
#[doc = " An interface that the core can use to access a device's camera.\n\n @see RETRO_ENVIRONMENT_GET_CAMERA_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_camera_callback {
    #[doc = " Requested camera capabilities,\n given as a bitmask of \\c retro_camera_buffer values.\n Set by the core.\n\n Here's a usage example:\n @code\n // Requesting support for camera data delivered as both an OpenGL texture and a pixel buffer:\n struct retro_camera_callback callback;\n callback.caps = (1 << RETRO_CAMERA_BUFFER_OPENGL_TEXTURE) | (1 << RETRO_CAMERA_BUFFER_RAW_FRAMEBUFFER);\n @endcode"]
    pub caps: u64,
    #[doc = " The desired width of the camera frame, in pixels.\n This is only a hint; the frontend may provide a different size.\n Set by the core.\n Use zero to let the frontend decide."]
    pub width: ::std::os::raw::c_uint,
    #[doc = " The desired height of the camera frame, in pixels.\n This is only a hint; the frontend may provide a different size.\n Set by the core.\n Use zero to let the frontend decide."]
    pub height: ::std::os::raw::c_uint,
    #[doc = " @copydoc retro_camera_start_t\n @see retro_camera_callback"]
    pub start: retro_camera_start_t,
    #[doc = " @copydoc retro_camera_stop_t\n @see retro_camera_callback"]
    pub stop: retro_camera_stop_t,
    #[doc = " @copydoc retro_camera_frame_raw_framebuffer_t\n @note If \\c NULL, this function will not be called."]
    pub frame_raw_framebuffer: retro_camera_frame_raw_framebuffer_t,
    #[doc = " @copydoc retro_camera_frame_opengl_texture_t\n @note If \\c NULL, this function will not be called."]
    pub frame_opengl_texture: retro_camera_frame_opengl_texture_t,
    #[doc = " Core-defined callback invoked by the frontend right after the camera driver is initialized\n (\\em not when calling \\c start).\n May be \\c NULL, in which case this function is skipped."]
    pub initialized: retro_camera_lifetime_status_t,
    #[doc = " Core-defined callback invoked by the frontend\n right before the video camera driver is deinitialized\n (\\em not when calling \\c stop).\n May be \\c NULL, in which case this function is skipped."]
    pub deinitialized: retro_camera_lifetime_status_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_camera_callback"][::std::mem::size_of::<retro_camera_callback>() - 64usize];
    ["Alignment of retro_camera_callback"]
        [::std::mem::align_of::<retro_camera_callback>() - 8usize];
    ["Offset of field: retro_camera_callback::caps"]
        [::std::mem::offset_of!(retro_camera_callback, caps) - 0usize];
    ["Offset of field: retro_camera_callback::width"]
        [::std::mem::offset_of!(retro_camera_callback, width) - 8usize];
    ["Offset of field: retro_camera_callback::height"]
        [::std::mem::offset_of!(retro_camera_callback, height) - 12usize];
    ["Offset of field: retro_camera_callback::start"]
        [::std::mem::offset_of!(retro_camera_callback, start) - 16usize];
    ["Offset of field: retro_camera_callback::stop"]
        [::std::mem::offset_of!(retro_camera_callback, stop) - 24usize];
    ["Offset of field: retro_camera_callback::frame_raw_framebuffer"]
        [::std::mem::offset_of!(retro_camera_callback, frame_raw_framebuffer) - 32usize];
    ["Offset of field: retro_camera_callback::frame_opengl_texture"]
        [::std::mem::offset_of!(retro_camera_callback, frame_opengl_texture) - 40usize];
    ["Offset of field: retro_camera_callback::initialized"]
        [::std::mem::offset_of!(retro_camera_callback, initialized) - 48usize];
    ["Offset of field: retro_camera_callback::deinitialized"]
        [::std::mem::offset_of!(retro_camera_callback, deinitialized) - 56usize];
};
#[doc = " @copydoc retro_location_callback::set_interval"]
pub type retro_location_set_interval_t = ::std::option::Option<
    unsafe extern "C" fn(
        interval_ms: ::std::os::raw::c_uint,
        interval_distance: ::std::os::raw::c_uint,
    ),
>;
#[doc = " @copydoc retro_location_callback::start"]
pub type retro_location_start_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " @copydoc retro_location_callback::stop"]
pub type retro_location_stop_t = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " @copydoc retro_location_callback::get_position"]
pub type retro_location_get_position_t = ::std::option::Option<
    unsafe extern "C" fn(
        lat: *mut f64,
        lon: *mut f64,
        horiz_accuracy: *mut f64,
        vert_accuracy: *mut f64,
    ) -> bool,
>;
#[doc = " Function type that reports the status of the location service."]
pub type retro_location_lifetime_status_t = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " An interface that the core can use to access a device's location.\n\n @note It is the frontend's responsibility to request the necessary permissions\n from the operating system.\n @see RETRO_ENVIRONMENT_GET_LOCATION_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_location_callback {
    #[doc = " Starts listening the device's location service.\n\n The frontend will report changes to the device's location\n at the interval defined by \\c set_interval.\n Set by the frontend.\n\n @return true if location services were successfully started, false otherwise.\n Note that this will return \\c false if location services are disabled\n or the frontend doesn't have permission to use them.\n @note The device's location service may or may not have been enabled\n before the core calls this function."]
    pub start: retro_location_start_t,
    #[doc = " Stop listening to the device's location service.\n\n Set by the frontend.\n\n @note The location service itself may or may not\n be turned off by this function,\n depending on the platform and the frontend.\n @post The core will stop receiving location service updates."]
    pub stop: retro_location_stop_t,
    #[doc = " Returns the device's current coordinates.\n\n Set by the frontend.\n\n @param[out] lat Pointer to latitude, in degrees.\n Will be set to 0 if no change has occurred since the last call.\n Behavior is undefined if \\c NULL.\n @param[out] lon Pointer to longitude, in degrees.\n Will be set to 0 if no change has occurred since the last call.\n Behavior is undefined if \\c NULL.\n @param[out] horiz_accuracy Pointer to horizontal accuracy.\n Will be set to 0 if no change has occurred since the last call.\n Behavior is undefined if \\c NULL.\n @param[out] vert_accuracy Pointer to vertical accuracy.\n Will be set to 0 if no change has occurred since the last call.\n Behavior is undefined if \\c NULL."]
    pub get_position: retro_location_get_position_t,
    #[doc = " Sets the rate at which the location service should report updates.\n\n This is only a hint; the actual rate may differ.\n Sets the interval of time and/or distance at which to update/poll\n location-based data.\n\n Some platforms may only support one of the two parameters;\n cores should provide both to ensure compatibility.\n\n Set by the frontend.\n\n @param interval_ms The desired period of time between location updates, in milliseconds.\n @param interval_distance The desired distance between location updates, in meters."]
    pub set_interval: retro_location_set_interval_t,
    #[doc = " Called when the location service is initialized. Set by the core. Optional."]
    pub initialized: retro_location_lifetime_status_t,
    #[doc = " Called when the location service is deinitialized. Set by the core. Optional."]
    pub deinitialized: retro_location_lifetime_status_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_location_callback"][::std::mem::size_of::<retro_location_callback>() - 48usize];
    ["Alignment of retro_location_callback"]
        [::std::mem::align_of::<retro_location_callback>() - 8usize];
    ["Offset of field: retro_location_callback::start"]
        [::std::mem::offset_of!(retro_location_callback, start) - 0usize];
    ["Offset of field: retro_location_callback::stop"]
        [::std::mem::offset_of!(retro_location_callback, stop) - 8usize];
    ["Offset of field: retro_location_callback::get_position"]
        [::std::mem::offset_of!(retro_location_callback, get_position) - 16usize];
    ["Offset of field: retro_location_callback::set_interval"]
        [::std::mem::offset_of!(retro_location_callback, set_interval) - 24usize];
    ["Offset of field: retro_location_callback::initialized"]
        [::std::mem::offset_of!(retro_location_callback, initialized) - 32usize];
    ["Offset of field: retro_location_callback::deinitialized"]
        [::std::mem::offset_of!(retro_location_callback, deinitialized) - 40usize];
};
pub const RETRO_RUMBLE_STRONG: retro_rumble_effect = 0;
pub const RETRO_RUMBLE_WEAK: retro_rumble_effect = 1;
#[doc = " @private Defined to ensure <tt>sizeof(enum retro_rumble_effect) == sizeof(int)</tt>. Do not use."]
pub const RETRO_RUMBLE_DUMMY: retro_rumble_effect = 2147483647;
#[doc = " The type of rumble motor in a controller.\n\n Both motors can be controlled independently,\n and the strong motor does not override the weak motor.\n @see RETRO_ENVIRONMENT_GET_RUMBLE_INTERFACE"]
pub type retro_rumble_effect = ::std::os::raw::c_uint;
#[doc = " Requests a rumble state change for a controller.\n Set by the frontend.\n\n @param port The controller port to set the rumble state for.\n @param effect The rumble motor to set the strength of.\n @param strength The desired intensity of the rumble motor, ranging from \\c 0 to \\c 0xffff (inclusive).\n @return \\c true if the requested rumble state was honored.\n If the controller doesn't support rumble, will return \\c false.\n @note Calling this before the first \\c retro_run() may return \\c false.\n @see RETRO_ENVIRONMENT_GET_RUMBLE_INTERFACE"]
pub type retro_set_rumble_state_t = ::std::option::Option<
    unsafe extern "C" fn(
        port: ::std::os::raw::c_uint,
        effect: retro_rumble_effect,
        strength: u16,
    ) -> bool,
>;
#[doc = " An interface that the core can use to set the rumble state of a controller.\n @see RETRO_ENVIRONMENT_GET_RUMBLE_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_rumble_interface {
    #[doc = " @copydoc retro_set_rumble_state_t"]
    pub set_rumble_state: retro_set_rumble_state_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_rumble_interface"][::std::mem::size_of::<retro_rumble_interface>() - 8usize];
    ["Alignment of retro_rumble_interface"]
        [::std::mem::align_of::<retro_rumble_interface>() - 8usize];
    ["Offset of field: retro_rumble_interface::set_rumble_state"]
        [::std::mem::offset_of!(retro_rumble_interface, set_rumble_state) - 0usize];
};
#[doc = " Called by the frontend to request audio samples.\n The core should render audio within this function\n using the callback provided by \\c retro_set_audio_sample or \\c retro_set_audio_sample_batch.\n\n @warning This function may be called by any thread,\n therefore it must be thread-safe.\n @see RETRO_ENVIRONMENT_SET_AUDIO_CALLBACK\n @see retro_audio_callback\n @see retro_audio_sample_batch_t\n @see retro_audio_sample_t"]
pub type retro_audio_callback_t = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " Called by the frontend to notify the core that it should pause or resume audio rendering.\n The initial state of the audio driver after registering this callback is \\c false (inactive).\n\n @param enabled \\c true if the frontend's audio driver is active.\n If so, the registered audio callback will be called regularly.\n If not, the audio callback will not be invoked until the next time\n the frontend calls this function with \\c true.\n @warning This function may be called by any thread,\n therefore it must be thread-safe.\n @note Even if no audio samples are rendered,\n the core should continue to update its emulated platform's audio engine if necessary.\n @see RETRO_ENVIRONMENT_SET_AUDIO_CALLBACK\n @see retro_audio_callback\n @see retro_audio_callback_t"]
pub type retro_audio_set_state_callback_t =
    ::std::option::Option<unsafe extern "C" fn(enabled: bool)>;
#[doc = " An interface that the frontend uses to request audio samples from the core.\n @note To unregister a callback, pass a \\c retro_audio_callback_t\n with both fields set to <tt>NULL</tt>.\n @see RETRO_ENVIRONMENT_SET_AUDIO_CALLBACK"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_audio_callback {
    #[doc = " @see retro_audio_callback_t"]
    pub callback: retro_audio_callback_t,
    #[doc = " @see retro_audio_set_state_callback_t"]
    pub set_state: retro_audio_set_state_callback_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_audio_callback"][::std::mem::size_of::<retro_audio_callback>() - 16usize];
    ["Alignment of retro_audio_callback"][::std::mem::align_of::<retro_audio_callback>() - 8usize];
    ["Offset of field: retro_audio_callback::callback"]
        [::std::mem::offset_of!(retro_audio_callback, callback) - 0usize];
    ["Offset of field: retro_audio_callback::set_state"]
        [::std::mem::offset_of!(retro_audio_callback, set_state) - 8usize];
};
pub type retro_usec_t = i64;
#[doc = " Called right before each iteration of \\c retro_run\n if registered via <tt>RETRO_ENVIRONMENT_SET_FRAME_TIME_CALLBACK</tt>.\n\n @param usec Time since the last call to <tt>retro_run</tt>, in microseconds.\n If the frontend is manipulating the frame time\n (e.g. via fast-forward or slow motion),\n this value will be the reference value initially provided to the environment call.\n @see RETRO_ENVIRONMENT_SET_FRAME_TIME_CALLBACK\n @see retro_frame_time_callback"]
pub type retro_frame_time_callback_t =
    ::std::option::Option<unsafe extern "C" fn(usec: retro_usec_t)>;
#[doc = " @see RETRO_ENVIRONMENT_SET_FRAME_TIME_CALLBACK"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_frame_time_callback {
    #[doc = " Called to notify the core of the current frame time.\n If <tt>NULL</tt>, the frontend will clear its registered callback."]
    pub callback: retro_frame_time_callback_t,
    #[doc = " The ideal duration of one frame, in microseconds.\n Compute it as <tt>1000000 / fps</tt>.\n The frontend will resolve rounding to ensure that framestepping, etc is exact."]
    pub reference: retro_usec_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_frame_time_callback"]
        [::std::mem::size_of::<retro_frame_time_callback>() - 16usize];
    ["Alignment of retro_frame_time_callback"]
        [::std::mem::align_of::<retro_frame_time_callback>() - 8usize];
    ["Offset of field: retro_frame_time_callback::callback"]
        [::std::mem::offset_of!(retro_frame_time_callback, callback) - 0usize];
    ["Offset of field: retro_frame_time_callback::reference"]
        [::std::mem::offset_of!(retro_frame_time_callback, reference) - 8usize];
};
#[doc = " Notifies a libretro core of how full the frontend's audio buffer is.\n Set by the core, called by the frontend.\n It will be called right before \\c retro_run() every frame.\n\n @param active \\c true if the frontend's audio buffer is currently in use,\n \\c false if audio is disabled in the frontend.\n @param occupancy A value between 0 and 100 (inclusive),\n corresponding to the frontend's audio buffer occupancy percentage.\n @param underrun_likely \\c true if the frontend expects an audio buffer underrun\n during the next frame, which indicates that a core should attempt frame-skipping."]
pub type retro_audio_buffer_status_callback_t = ::std::option::Option<
    unsafe extern "C" fn(active: bool, occupancy: ::std::os::raw::c_uint, underrun_likely: bool),
>;
#[doc = " A callback to register with the frontend to receive audio buffer occupancy information."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_audio_buffer_status_callback {
    #[doc = " @copydoc retro_audio_buffer_status_callback_t"]
    pub callback: retro_audio_buffer_status_callback_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_audio_buffer_status_callback"]
        [::std::mem::size_of::<retro_audio_buffer_status_callback>() - 8usize];
    ["Alignment of retro_audio_buffer_status_callback"]
        [::std::mem::align_of::<retro_audio_buffer_status_callback>() - 8usize];
    ["Offset of field: retro_audio_buffer_status_callback::callback"]
        [::std::mem::offset_of!(retro_audio_buffer_status_callback, callback) - 0usize];
};
pub type retro_hw_context_reset_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_hw_get_current_framebuffer_t =
    ::std::option::Option<unsafe extern "C" fn() -> usize>;
pub type retro_hw_get_proc_address_t = ::std::option::Option<
    unsafe extern "C" fn(sym: *const ::std::os::raw::c_char) -> retro_proc_address_t,
>;
pub const RETRO_HW_CONTEXT_NONE: retro_hw_context_type = 0;
pub const RETRO_HW_CONTEXT_OPENGL: retro_hw_context_type = 1;
pub const RETRO_HW_CONTEXT_OPENGLES2: retro_hw_context_type = 2;
pub const RETRO_HW_CONTEXT_OPENGL_CORE: retro_hw_context_type = 3;
pub const RETRO_HW_CONTEXT_OPENGLES3: retro_hw_context_type = 4;
pub const RETRO_HW_CONTEXT_OPENGLES_VERSION: retro_hw_context_type = 5;
pub const RETRO_HW_CONTEXT_VULKAN: retro_hw_context_type = 6;
pub const RETRO_HW_CONTEXT_D3D11: retro_hw_context_type = 7;
pub const RETRO_HW_CONTEXT_D3D10: retro_hw_context_type = 8;
pub const RETRO_HW_CONTEXT_D3D12: retro_hw_context_type = 9;
pub const RETRO_HW_CONTEXT_D3D9: retro_hw_context_type = 10;
#[doc = " Dummy value to ensure sizeof(enum retro_hw_context_type) == sizeof(int). Do not use."]
pub const RETRO_HW_CONTEXT_DUMMY: retro_hw_context_type = 2147483647;
pub type retro_hw_context_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_hw_render_callback {
    pub context_type: retro_hw_context_type,
    pub context_reset: retro_hw_context_reset_t,
    pub get_current_framebuffer: retro_hw_get_current_framebuffer_t,
    pub get_proc_address: retro_hw_get_proc_address_t,
    pub depth: bool,
    pub stencil: bool,
    pub bottom_left_origin: bool,
    pub version_major: ::std::os::raw::c_uint,
    pub version_minor: ::std::os::raw::c_uint,
    pub cache_context: bool,
    pub context_destroy: retro_hw_context_reset_t,
    pub debug_context: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_hw_render_callback"]
        [::std::mem::size_of::<retro_hw_render_callback>() - 64usize];
    ["Alignment of retro_hw_render_callback"]
        [::std::mem::align_of::<retro_hw_render_callback>() - 8usize];
    ["Offset of field: retro_hw_render_callback::context_type"]
        [::std::mem::offset_of!(retro_hw_render_callback, context_type) - 0usize];
    ["Offset of field: retro_hw_render_callback::context_reset"]
        [::std::mem::offset_of!(retro_hw_render_callback, context_reset) - 8usize];
    ["Offset of field: retro_hw_render_callback::get_current_framebuffer"]
        [::std::mem::offset_of!(retro_hw_render_callback, get_current_framebuffer) - 16usize];
    ["Offset of field: retro_hw_render_callback::get_proc_address"]
        [::std::mem::offset_of!(retro_hw_render_callback, get_proc_address) - 24usize];
    ["Offset of field: retro_hw_render_callback::depth"]
        [::std::mem::offset_of!(retro_hw_render_callback, depth) - 32usize];
    ["Offset of field: retro_hw_render_callback::stencil"]
        [::std::mem::offset_of!(retro_hw_render_callback, stencil) - 33usize];
    ["Offset of field: retro_hw_render_callback::bottom_left_origin"]
        [::std::mem::offset_of!(retro_hw_render_callback, bottom_left_origin) - 34usize];
    ["Offset of field: retro_hw_render_callback::version_major"]
        [::std::mem::offset_of!(retro_hw_render_callback, version_major) - 36usize];
    ["Offset of field: retro_hw_render_callback::version_minor"]
        [::std::mem::offset_of!(retro_hw_render_callback, version_minor) - 40usize];
    ["Offset of field: retro_hw_render_callback::cache_context"]
        [::std::mem::offset_of!(retro_hw_render_callback, cache_context) - 44usize];
    ["Offset of field: retro_hw_render_callback::context_destroy"]
        [::std::mem::offset_of!(retro_hw_render_callback, context_destroy) - 48usize];
    ["Offset of field: retro_hw_render_callback::debug_context"]
        [::std::mem::offset_of!(retro_hw_render_callback, debug_context) - 56usize];
};
impl Default for retro_hw_render_callback {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type retro_keyboard_event_t = ::std::option::Option<
    unsafe extern "C" fn(
        down: bool,
        keycode: ::std::os::raw::c_uint,
        character: u32,
        key_modifiers: u16,
    ),
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_keyboard_callback {
    pub callback: retro_keyboard_event_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_keyboard_callback"][::std::mem::size_of::<retro_keyboard_callback>() - 8usize];
    ["Alignment of retro_keyboard_callback"]
        [::std::mem::align_of::<retro_keyboard_callback>() - 8usize];
    ["Offset of field: retro_keyboard_callback::callback"]
        [::std::mem::offset_of!(retro_keyboard_callback, callback) - 0usize];
};
#[doc = " Called by the frontend to open or close the emulated console's virtual disk tray.\n\n The frontend may only set the disk image index\n while the emulated tray is opened.\n\n If the emulated console's disk tray is already in the state given by \\c ejected,\n then this function should return \\c true without doing anything.\n The core should return \\c false if it couldn't change the disk tray's state;\n this may happen if the console itself limits when the disk tray can be open or closed\n (e.g. to wait for the disc to stop spinning).\n\n @param ejected \\c true if the virtual disk tray should be \"ejected\",\n \\c false if it should be \"closed\".\n @return \\c true if the virtual disk tray's state has been set to the given state,\n false if there was an error.\n @see retro_get_eject_state_t"]
pub type retro_set_eject_state_t =
    ::std::option::Option<unsafe extern "C" fn(ejected: bool) -> bool>;
#[doc = " Gets the current ejected state of the disk drive.\n The initial state is closed, i.e. \\c false.\n\n @return \\c true if the virtual disk tray is \"ejected\",\n i.e. it's open and a disk can be inserted.\n @see retro_set_eject_state_t"]
pub type retro_get_eject_state_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " Gets the index of the current disk image,\n as determined by however the frontend orders disk images\n (such as m3u-formatted playlists or special directories).\n\n @return The index of the current disk image\n (starting with 0 for the first disk),\n or a value greater than or equal to \\c get_num_images() if no disk is inserted.\n @see retro_get_num_images_t"]
pub type retro_get_image_index_t =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>;
#[doc = " Inserts the disk image at the given index into the emulated console's drive.\n Can only be called while the disk tray is ejected\n (i.e. \\c retro_get_eject_state_t returns \\c true).\n\n If the emulated disk tray is ejected\n and already contains the disk image named by \\c index,\n then this function should do nothing and return \\c true.\n\n @param index The index of the disk image to insert,\n starting from 0 for the first disk.\n A value greater than or equal to \\c get_num_images()\n represents the frontend removing the disk without inserting a new one.\n @return \\c true if the disk image was successfully set.\n \\c false if the disk tray isn't ejected or there was another error\n inserting a new disk image."]
pub type retro_set_image_index_t =
    ::std::option::Option<unsafe extern "C" fn(index: ::std::os::raw::c_uint) -> bool>;
#[doc = " @return The number of disk images which are available to use.\n These are most likely defined in a playlist file."]
pub type retro_get_num_images_t =
    ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_uint>;
#[doc = " Replaces the disk image at the given index with a new disk.\n\n Replaces the disk image associated with index.\n Arguments to pass in info have same requirements as retro_load_game().\n Virtual disk tray must be ejected when calling this.\n\n Passing \\c NULL to this function indicates\n that the frontend has removed this disk image from its internal list.\n As a result, calls to this function can change the number of available disk indexes.\n\n For example, calling <tt>replace_image_index(1, NULL)</tt>\n will remove the disk image at index 1,\n and the disk image at index 2 (if any)\n will be moved to the newly-available index 1.\n\n @param index The index of the disk image to replace.\n @param info Details about the new disk image,\n or \\c NULL if the disk image at the given index should be discarded.\n The semantics of each field are the same as in \\c retro_load_game.\n @return \\c true if the disk image was successfully replaced\n or removed from the playlist,\n \\c false if the tray is not ejected\n or if there was an error."]
pub type retro_replace_image_index_t = ::std::option::Option<
    unsafe extern "C" fn(index: ::std::os::raw::c_uint, info: *const retro_game_info) -> bool,
>;
#[doc = " Adds a new index to the core's internal disk list.\n This will increment the return value from \\c get_num_images() by 1.\n This image index cannot be used until a disk image has been set\n with \\c replace_image_index.\n\n @return \\c true if the core has added space for a new disk image\n and is ready to receive one."]
pub type retro_add_image_index_t = ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " Sets the disk image that will be inserted into the emulated disk drive\n before \\c retro_load_game is called.\n\n \\c retro_load_game does not provide a way to ensure\n that a particular disk image in a playlist is inserted into the console;\n this function makes up for that.\n Frontends should call it immediately before \\c retro_load_game,\n and the core should use the arguments\n to validate the disk image in \\c retro_load_game.\n\n When content is loaded, the core should verify that the\n disk specified by \\c index can be found at \\c path.\n This is to guard against auto-selecting the wrong image\n if (for example) the user should modify an existing M3U playlist.\n We have to let the core handle this because\n \\c set_initial_image() must be called before loading content,\n i.e. the frontend cannot access image paths in advance\n and thus cannot perform the error check itself.\n If \\c index is invalid (i.e. <tt>index >= get_num_images()</tt>)\n or the disk image doesn't match the value given in \\c path,\n the core should ignore the arguments\n and insert the disk at index 0 into the virtual disk tray.\n\n @warning If \\c RETRO_ENVIRONMENT_SET_DISK_CONTROL_EXT_INTERFACE is called within \\c retro_load_game,\n then this function may not be executed.\n Set the disk control interface in \\c retro_init if possible.\n\n @param index The index of the disk image within the playlist to set.\n @param path The path of the disk image to set as the first.\n The core should not load this path immediately;\n instead, it should use it within \\c retro_load_game\n to verify that the correct disk image was loaded.\n @return \\c true if the initial disk index was set,\n \\c false if the arguments are invalid\n or the core doesn't support this function."]
pub type retro_set_initial_image_t = ::std::option::Option<
    unsafe extern "C" fn(
        index: ::std::os::raw::c_uint,
        path: *const ::std::os::raw::c_char,
    ) -> bool,
>;
#[doc = " Returns the path of the disk image at the given index\n on the host's file system.\n\n @param index The index of the disk image to get the path of.\n @param path A buffer to store the path in.\n @param len The size of \\c path, in bytes.\n @return \\c true if the disk image's location was successfully\n queried and copied into \\c path,\n \\c false if the index is invalid\n or the core couldn't locate the disk image."]
pub type retro_get_image_path_t = ::std::option::Option<
    unsafe extern "C" fn(
        index: ::std::os::raw::c_uint,
        path: *mut ::std::os::raw::c_char,
        len: usize,
    ) -> bool,
>;
#[doc = " Returns a friendly label for the given disk image.\n\n In the simplest case, this may be the disk image's file name\n with the extension omitted.\n For cores or games with more complex content requirements,\n the label can be used to provide information to help the player\n select a disk image to insert;\n for example, a core may label different kinds of disks\n (save data, level disk, installation disk, bonus content, etc.).\n with names that correspond to in-game prompts,\n so that the frontend can provide better guidance to the player.\n\n @param index The index of the disk image to return a label for.\n @param label A buffer to store the resulting label in.\n @param len The length of \\c label, in bytes.\n @return \\c true if the disk image at \\c index is valid\n and a label was copied into \\c label."]
pub type retro_get_image_label_t = ::std::option::Option<
    unsafe extern "C" fn(
        index: ::std::os::raw::c_uint,
        label: *mut ::std::os::raw::c_char,
        len: usize,
    ) -> bool,
>;
#[doc = " An interface that the frontend can use to exchange disks\n within the emulated console's disk drive.\n\n All function pointers are required.\n\n @deprecated This struct is superseded by \\ref retro_disk_control_ext_callback.\n Only use this one to maintain compatibility\n with older cores and frontends.\n\n @see RETRO_ENVIRONMENT_SET_DISK_CONTROL_EXT_INTERFACE\n @see retro_disk_control_ext_callback"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_disk_control_callback {
    #[doc = " @copydoc retro_set_eject_state_t"]
    pub set_eject_state: retro_set_eject_state_t,
    #[doc = " @copydoc retro_get_eject_state_t"]
    pub get_eject_state: retro_get_eject_state_t,
    #[doc = " @copydoc retro_get_image_index_t"]
    pub get_image_index: retro_get_image_index_t,
    #[doc = " @copydoc retro_set_image_index_t"]
    pub set_image_index: retro_set_image_index_t,
    #[doc = " @copydoc retro_get_num_images_t"]
    pub get_num_images: retro_get_num_images_t,
    #[doc = " @copydoc retro_replace_image_index_t"]
    pub replace_image_index: retro_replace_image_index_t,
    #[doc = " @copydoc retro_add_image_index_t"]
    pub add_image_index: retro_add_image_index_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_disk_control_callback"]
        [::std::mem::size_of::<retro_disk_control_callback>() - 56usize];
    ["Alignment of retro_disk_control_callback"]
        [::std::mem::align_of::<retro_disk_control_callback>() - 8usize];
    ["Offset of field: retro_disk_control_callback::set_eject_state"]
        [::std::mem::offset_of!(retro_disk_control_callback, set_eject_state) - 0usize];
    ["Offset of field: retro_disk_control_callback::get_eject_state"]
        [::std::mem::offset_of!(retro_disk_control_callback, get_eject_state) - 8usize];
    ["Offset of field: retro_disk_control_callback::get_image_index"]
        [::std::mem::offset_of!(retro_disk_control_callback, get_image_index) - 16usize];
    ["Offset of field: retro_disk_control_callback::set_image_index"]
        [::std::mem::offset_of!(retro_disk_control_callback, set_image_index) - 24usize];
    ["Offset of field: retro_disk_control_callback::get_num_images"]
        [::std::mem::offset_of!(retro_disk_control_callback, get_num_images) - 32usize];
    ["Offset of field: retro_disk_control_callback::replace_image_index"]
        [::std::mem::offset_of!(retro_disk_control_callback, replace_image_index) - 40usize];
    ["Offset of field: retro_disk_control_callback::add_image_index"]
        [::std::mem::offset_of!(retro_disk_control_callback, add_image_index) - 48usize];
};
#[doc = " @copybrief retro_disk_control_callback\n\n All function pointers are required unless otherwise noted.\n\n @see RETRO_ENVIRONMENT_SET_DISK_CONTROL_EXT_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_disk_control_ext_callback {
    #[doc = " @copydoc retro_set_eject_state_t"]
    pub set_eject_state: retro_set_eject_state_t,
    #[doc = " @copydoc retro_get_eject_state_t"]
    pub get_eject_state: retro_get_eject_state_t,
    #[doc = " @copydoc retro_get_image_index_t"]
    pub get_image_index: retro_get_image_index_t,
    #[doc = " @copydoc retro_set_image_index_t"]
    pub set_image_index: retro_set_image_index_t,
    #[doc = " @copydoc retro_get_num_images_t"]
    pub get_num_images: retro_get_num_images_t,
    #[doc = " @copydoc retro_replace_image_index_t"]
    pub replace_image_index: retro_replace_image_index_t,
    #[doc = " @copydoc retro_add_image_index_t"]
    pub add_image_index: retro_add_image_index_t,
    #[doc = " @copydoc retro_set_initial_image_t\n\n Optional; not called if \\c NULL.\n\n @note The frontend will only try to record/restore the last-used disk index\n if both \\c set_initial_image and \\c get_image_path are implemented."]
    pub set_initial_image: retro_set_initial_image_t,
    #[doc = " @copydoc retro_get_image_path_t\n\n Optional; not called if \\c NULL."]
    pub get_image_path: retro_get_image_path_t,
    #[doc = " @copydoc retro_get_image_label_t\n\n Optional; not called if \\c NULL."]
    pub get_image_label: retro_get_image_label_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_disk_control_ext_callback"]
        [::std::mem::size_of::<retro_disk_control_ext_callback>() - 80usize];
    ["Alignment of retro_disk_control_ext_callback"]
        [::std::mem::align_of::<retro_disk_control_ext_callback>() - 8usize];
    ["Offset of field: retro_disk_control_ext_callback::set_eject_state"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, set_eject_state) - 0usize];
    ["Offset of field: retro_disk_control_ext_callback::get_eject_state"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, get_eject_state) - 8usize];
    ["Offset of field: retro_disk_control_ext_callback::get_image_index"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, get_image_index) - 16usize];
    ["Offset of field: retro_disk_control_ext_callback::set_image_index"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, set_image_index) - 24usize];
    ["Offset of field: retro_disk_control_ext_callback::get_num_images"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, get_num_images) - 32usize];
    ["Offset of field: retro_disk_control_ext_callback::replace_image_index"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, replace_image_index) - 40usize];
    ["Offset of field: retro_disk_control_ext_callback::add_image_index"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, add_image_index) - 48usize];
    ["Offset of field: retro_disk_control_ext_callback::set_initial_image"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, set_initial_image) - 56usize];
    ["Offset of field: retro_disk_control_ext_callback::get_image_path"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, get_image_path) - 64usize];
    ["Offset of field: retro_disk_control_ext_callback::get_image_label"]
        [::std::mem::offset_of!(retro_disk_control_ext_callback, get_image_label) - 72usize];
};
pub type retro_netpacket_send_t = ::std::option::Option<
    unsafe extern "C" fn(
        flags: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        client_id: u16,
    ),
>;
pub type retro_netpacket_poll_receive_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_netpacket_start_t = ::std::option::Option<
    unsafe extern "C" fn(
        client_id: u16,
        send_fn: retro_netpacket_send_t,
        poll_receive_fn: retro_netpacket_poll_receive_t,
    ),
>;
pub type retro_netpacket_receive_t = ::std::option::Option<
    unsafe extern "C" fn(buf: *const ::std::os::raw::c_void, len: usize, client_id: u16),
>;
pub type retro_netpacket_stop_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_netpacket_poll_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type retro_netpacket_connected_t =
    ::std::option::Option<unsafe extern "C" fn(client_id: u16) -> bool>;
pub type retro_netpacket_disconnected_t =
    ::std::option::Option<unsafe extern "C" fn(client_id: u16)>;
#[doc = " A callback interface for giving a core the ability to send and receive custom\n network packets during a multiplayer session between two or more instances\n of a libretro frontend.\n\n Normally during connection handshake the frontend will compare library_version\n used by both parties and show a warning if there is a difference. When the core\n supplies protocol_version, the frontend will check against this instead.\n\n @see RETRO_ENVIRONMENT_SET_NETPACKET_INTERFACE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_netpacket_callback {
    pub start: retro_netpacket_start_t,
    pub receive: retro_netpacket_receive_t,
    pub stop: retro_netpacket_stop_t,
    pub poll: retro_netpacket_poll_t,
    pub connected: retro_netpacket_connected_t,
    pub disconnected: retro_netpacket_disconnected_t,
    pub protocol_version: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_netpacket_callback"]
        [::std::mem::size_of::<retro_netpacket_callback>() - 56usize];
    ["Alignment of retro_netpacket_callback"]
        [::std::mem::align_of::<retro_netpacket_callback>() - 8usize];
    ["Offset of field: retro_netpacket_callback::start"]
        [::std::mem::offset_of!(retro_netpacket_callback, start) - 0usize];
    ["Offset of field: retro_netpacket_callback::receive"]
        [::std::mem::offset_of!(retro_netpacket_callback, receive) - 8usize];
    ["Offset of field: retro_netpacket_callback::stop"]
        [::std::mem::offset_of!(retro_netpacket_callback, stop) - 16usize];
    ["Offset of field: retro_netpacket_callback::poll"]
        [::std::mem::offset_of!(retro_netpacket_callback, poll) - 24usize];
    ["Offset of field: retro_netpacket_callback::connected"]
        [::std::mem::offset_of!(retro_netpacket_callback, connected) - 32usize];
    ["Offset of field: retro_netpacket_callback::disconnected"]
        [::std::mem::offset_of!(retro_netpacket_callback, disconnected) - 40usize];
    ["Offset of field: retro_netpacket_callback::protocol_version"]
        [::std::mem::offset_of!(retro_netpacket_callback, protocol_version) - 48usize];
};
impl Default for retro_netpacket_callback {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " 0RGB1555, native endian.\n Used as the default if \\c RETRO_ENVIRONMENT_SET_PIXEL_FORMAT is not called.\n The most significant bit must be set to 0.\n @deprecated This format remains supported to maintain compatibility.\n New code should use <tt>RETRO_PIXEL_FORMAT_RGB565</tt> instead.\n @see RETRO_PIXEL_FORMAT_RGB565"]
pub const RETRO_PIXEL_FORMAT_0RGB1555: retro_pixel_format = 0;
#[doc = " XRGB8888, native endian.\n The most significant byte (the <tt>X</tt>) is ignored."]
pub const RETRO_PIXEL_FORMAT_XRGB8888: retro_pixel_format = 1;
#[doc = " RGB565, native endian.\n This format is recommended if 16-bit pixels are desired,\n as it is available on a variety of devices and APIs."]
pub const RETRO_PIXEL_FORMAT_RGB565: retro_pixel_format = 2;
#[doc = " Defined to ensure that <tt>sizeof(retro_pixel_format) == sizeof(int)</tt>. Do not use."]
pub const RETRO_PIXEL_FORMAT_UNKNOWN: retro_pixel_format = 2147483647;
#[doc = " The pixel format used for rendering.\n @see RETRO_ENVIRONMENT_SET_PIXEL_FORMAT"]
pub type retro_pixel_format = ::std::os::raw::c_uint;
#[doc = " Standard savestate written to disk.\n May be loaded at any time,\n even in a separate session or on another device.\n\n Should not contain any pointers to code or data."]
pub const RETRO_SAVESTATE_CONTEXT_NORMAL: retro_savestate_context = 0;
#[doc = " The savestate is guaranteed to be loaded\n within the same session, address space, and binary.\n Will not be written to disk or sent over the network;\n therefore, internal pointers to code or data are acceptable.\n May still be loaded or saved at any time.\n\n @note This context generally implies the use of runahead or rewinding,\n which may work by taking savestates multiple times per second.\n Savestate code that runs in this context should be fast."]
pub const RETRO_SAVESTATE_CONTEXT_RUNAHEAD_SAME_INSTANCE: retro_savestate_context = 1;
#[doc = " The savestate is guaranteed to be loaded\n in the same session and by the same binary,\n but possibly by a different address space\n (e.g. for \"second instance\" runahead)\n\n Will not be written to disk or sent over the network,\n but may be loaded in a different address space.\n Therefore, the savestate <em>must not</em> contain pointers."]
pub const RETRO_SAVESTATE_CONTEXT_RUNAHEAD_SAME_BINARY: retro_savestate_context = 2;
#[doc = " The savestate will not be written to disk,\n but no other guarantees are made.\n The savestate will almost certainly be loaded\n by a separate binary, device, and address space.\n\n This context is intended for use with frontends that support rollback netplay.\n Serialized state should omit any data that would unnecessarily increase bandwidth usage.\n Must not contain pointers, and integers must be saved in big-endian format.\n @see retro_endianness.h\n @see network_stream"]
pub const RETRO_SAVESTATE_CONTEXT_ROLLBACK_NETPLAY: retro_savestate_context = 3;
#[doc = " @private Defined to ensure <tt>sizeof(retro_savestate_context) == sizeof(int)</tt>.\n Do not use."]
pub const RETRO_SAVESTATE_CONTEXT_UNKNOWN: retro_savestate_context = 2147483647;
#[doc = " Details about how the frontend will use savestates.\n\n @see RETRO_ENVIRONMENT_GET_SAVESTATE_CONTEXT\n @see retro_serialize"]
pub type retro_savestate_context = ::std::os::raw::c_uint;
#[doc = " Defines a message that the frontend will display to the user,\n as determined by <tt>RETRO_ENVIRONMENT_SET_MESSAGE</tt>.\n\n @deprecated This struct is superseded by \\ref retro_message_ext,\n which provides more control over how a message is presented.\n Only use it for compatibility with older cores and frontends.\n\n @see RETRO_ENVIRONMENT_SET_MESSAGE\n @see retro_message_ext"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_message {
    #[doc = " Null-terminated message to be displayed.\n If \\c NULL or empty, the message will be ignored."]
    pub msg: *const ::std::os::raw::c_char,
    #[doc = " Duration to display \\c msg in frames."]
    pub frames: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_message"][::std::mem::size_of::<retro_message>() - 16usize];
    ["Alignment of retro_message"][::std::mem::align_of::<retro_message>() - 8usize];
    ["Offset of field: retro_message::msg"][::std::mem::offset_of!(retro_message, msg) - 0usize];
    ["Offset of field: retro_message::frames"]
        [::std::mem::offset_of!(retro_message, frames) - 8usize];
};
impl Default for retro_message {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Indicates that the frontend should display the given message\n using all other targets defined by \\c retro_message_target at once."]
pub const RETRO_MESSAGE_TARGET_ALL: retro_message_target = 0;
#[doc = " Indicates that the frontend should display the given message\n using the frontend's on-screen display, if available.\n\n @attention If the frontend allows players to customize or disable notifications,\n then they may not see messages sent to this target."]
pub const RETRO_MESSAGE_TARGET_OSD: retro_message_target = 1;
#[doc = " Indicates that the frontend should log the message\n via its usual logging mechanism, if available.\n\n This is not intended to be a substitute for \\c RETRO_ENVIRONMENT_SET_LOG_INTERFACE.\n It is intended for the common use case of\n logging a player-facing message.\n\n This target should not be used for messages\n of type \\c RETRO_MESSAGE_TYPE_STATUS or \\c RETRO_MESSAGE_TYPE_PROGRESS,\n as it may add unnecessary noise to a log file.\n\n @see RETRO_ENVIRONMENT_SET_LOG_INTERFACE"]
pub const RETRO_MESSAGE_TARGET_LOG: retro_message_target = 2;
#[doc = " The method that the frontend will use to display a message to the player.\n @see retro_message_ext"]
pub type retro_message_target = ::std::os::raw::c_uint;
#[doc = " A standard on-screen message.\n\n Suitable for a variety of use cases,\n such as messages about errors\n or other important events.\n\n Frontends that display their own messages\n should display this type of core-generated message the same way."]
pub const RETRO_MESSAGE_TYPE_NOTIFICATION: retro_message_type = 0;
#[doc = " An on-screen message that should be visually distinct\n from \\c RETRO_MESSAGE_TYPE_NOTIFICATION messages.\n\n The exact meaning of \"visually distinct\" is left to the frontend,\n but this usually implies that the frontend shows the message\n in a way that it doesn't typically use for its own notices."]
pub const RETRO_MESSAGE_TYPE_NOTIFICATION_ALT: retro_message_type = 1;
#[doc = " Indicates a frequently-updated status display,\n rather than a standard notification.\n Status messages are intended to be displayed permanently while a core is running\n in a way that doesn't suggest user action is required.\n\n Here are some possible use cases for status messages:\n\n @li An internal framerate counter.\n @li Debugging information.\n     Remember to let the player disable it in the core options.\n @li Core-specific state, such as when a microphone is active.\n\n The status message is displayed for the given duration,\n unless another status message of equal or greater priority is shown."]
pub const RETRO_MESSAGE_TYPE_STATUS: retro_message_type = 2;
#[doc = " Denotes a message that reports the progress\n of a long-running asynchronous task,\n such as when a core loads large files from disk or the network.\n\n The frontend should display messages of this type as a progress bar\n (or a progress spinner for indefinite tasks),\n where \\c retro_message_ext::msg is the progress bar's title\n and \\c retro_message_ext::progress sets the progress bar's length.\n\n This message type shouldn't be used for tasks that are expected to complete quickly."]
pub const RETRO_MESSAGE_TYPE_PROGRESS: retro_message_type = 3;
#[doc = " A broad category for the type of message that the frontend will display.\n\n Each message type has its own use case,\n therefore the frontend should present each one differently.\n\n @note This is a hint that the frontend may ignore.\n The frontend should fall back to \\c RETRO_MESSAGE_TYPE_NOTIFICATION\n for message types that it doesn't support."]
pub type retro_message_type = ::std::os::raw::c_uint;
#[doc = " A core-provided message that the frontend will display to the player.\n\n @note The frontend is encouraged store these messages in a queue.\n However, it should not empty the queue of core-submitted messages upon exit;\n if a core exits with an error, it may want to use this API\n to show an error message to the player.\n\n The frontend should maintain its own copy of the submitted message\n and all subobjects, including strings.\n\n @see RETRO_ENVIRONMENT_SET_MESSAGE_EXT"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_message_ext {
    #[doc = " The \\c NULL-terminated text of a message to show to the player.\n Must not be \\c NULL.\n\n @note The frontend must honor newlines in this string\n when rendering text to \\c RETRO_MESSAGE_TARGET_OSD."]
    pub msg: *const ::std::os::raw::c_char,
    #[doc = " The duration that \\c msg will be displayed on-screen, in milliseconds.\n\n Ignored for \\c RETRO_MESSAGE_TARGET_LOG."]
    pub duration: ::std::os::raw::c_uint,
    #[doc = " The relative importance of this message\n when targeting \\c RETRO_MESSAGE_TARGET_OSD.\n Higher values indicate higher priority.\n\n The frontend should use this to prioritize messages\n when it can't show all active messages at once,\n or to remove messages from its queue if it's full.\n\n The relative display order of messages with the same priority\n is left to the frontend's discretion,\n although we suggest breaking ties\n in favor of the most recently-submitted message.\n\n Frontends may handle deprioritized messages at their discretion;\n such messages may have their \\c duration altered,\n be hidden without being delayed,\n or even be discarded entirely.\n\n @note In the reference frontend (RetroArch),\n the same priority values are used for frontend-generated notifications,\n which are typically between 0 and 3 depending upon importance.\n\n Ignored for \\c RETRO_MESSAGE_TARGET_LOG."]
    pub priority: ::std::os::raw::c_uint,
    #[doc = " The severity level of this message.\n\n The frontend may use this to filter or customize messages\n depending on the player's preferences.\n Here are some ideas:\n\n @li Use this to prioritize errors and warnings\n     over higher-ranking info and debug messages.\n @li Render warnings or errors with extra visual feedback,\n     e.g. with brighter colors or accompanying sound effects.\n\n @see RETRO_ENVIRONMENT_SET_LOG_INTERFACE"]
    pub level: retro_log_level,
    #[doc = " The intended destination of this message.\n\n @see retro_message_target"]
    pub target: retro_message_target,
    #[doc = " The intended semantics of this message.\n\n Ignored for \\c RETRO_MESSAGE_TARGET_LOG.\n\n @see retro_message_type"]
    pub type_: retro_message_type,
    #[doc = " The progress of an asynchronous task.\n\n A value between 0 and 100 (inclusive) indicates the task's percentage,\n and a value of -1 indicates a task of unknown completion.\n\n @note Since message type is a hint, a frontend may ignore progress values.\n Where relevant, a core should include progress percentage within the message string,\n such that the message intent remains clear when displayed\n as a standard frontend-generated notification.\n\n Ignored for \\c RETRO_MESSAGE_TARGET_LOG and for\n message types other than \\c RETRO_MESSAGE_TYPE_PROGRESS."]
    pub progress: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_message_ext"][::std::mem::size_of::<retro_message_ext>() - 32usize];
    ["Alignment of retro_message_ext"][::std::mem::align_of::<retro_message_ext>() - 8usize];
    ["Offset of field: retro_message_ext::msg"]
        [::std::mem::offset_of!(retro_message_ext, msg) - 0usize];
    ["Offset of field: retro_message_ext::duration"]
        [::std::mem::offset_of!(retro_message_ext, duration) - 8usize];
    ["Offset of field: retro_message_ext::priority"]
        [::std::mem::offset_of!(retro_message_ext, priority) - 12usize];
    ["Offset of field: retro_message_ext::level"]
        [::std::mem::offset_of!(retro_message_ext, level) - 16usize];
    ["Offset of field: retro_message_ext::target"]
        [::std::mem::offset_of!(retro_message_ext, target) - 20usize];
    ["Offset of field: retro_message_ext::type_"]
        [::std::mem::offset_of!(retro_message_ext, type_) - 24usize];
    ["Offset of field: retro_message_ext::progress"]
        [::std::mem::offset_of!(retro_message_ext, progress) - 28usize];
};
impl Default for retro_message_ext {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_input_descriptor {
    pub port: ::std::os::raw::c_uint,
    pub device: ::std::os::raw::c_uint,
    pub index: ::std::os::raw::c_uint,
    pub id: ::std::os::raw::c_uint,
    pub description: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_input_descriptor"][::std::mem::size_of::<retro_input_descriptor>() - 24usize];
    ["Alignment of retro_input_descriptor"]
        [::std::mem::align_of::<retro_input_descriptor>() - 8usize];
    ["Offset of field: retro_input_descriptor::port"]
        [::std::mem::offset_of!(retro_input_descriptor, port) - 0usize];
    ["Offset of field: retro_input_descriptor::device"]
        [::std::mem::offset_of!(retro_input_descriptor, device) - 4usize];
    ["Offset of field: retro_input_descriptor::index"]
        [::std::mem::offset_of!(retro_input_descriptor, index) - 8usize];
    ["Offset of field: retro_input_descriptor::id"]
        [::std::mem::offset_of!(retro_input_descriptor, id) - 12usize];
    ["Offset of field: retro_input_descriptor::description"]
        [::std::mem::offset_of!(retro_input_descriptor, description) - 16usize];
};
impl Default for retro_input_descriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Contains basic information about the core.\n\n @see retro_get_system_info\n @warning All pointers are owned by the core\n and must remain valid throughout its lifetime."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_system_info {
    #[doc = " Descriptive name of the library.\n\n @note Should not contain any version numbers, etc."]
    pub library_name: *const ::std::os::raw::c_char,
    #[doc = " Descriptive version of the core."]
    pub library_version: *const ::std::os::raw::c_char,
    #[doc = " A pipe-delimited string list of file extensions that this core can load, e.g. \"bin|rom|iso\".\n Typically used by a frontend for filtering or core selection."]
    pub valid_extensions: *const ::std::os::raw::c_char,
    pub need_fullpath: bool,
    pub block_extract: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_system_info"][::std::mem::size_of::<retro_system_info>() - 32usize];
    ["Alignment of retro_system_info"][::std::mem::align_of::<retro_system_info>() - 8usize];
    ["Offset of field: retro_system_info::library_name"]
        [::std::mem::offset_of!(retro_system_info, library_name) - 0usize];
    ["Offset of field: retro_system_info::library_version"]
        [::std::mem::offset_of!(retro_system_info, library_version) - 8usize];
    ["Offset of field: retro_system_info::valid_extensions"]
        [::std::mem::offset_of!(retro_system_info, valid_extensions) - 16usize];
    ["Offset of field: retro_system_info::need_fullpath"]
        [::std::mem::offset_of!(retro_system_info, need_fullpath) - 24usize];
    ["Offset of field: retro_system_info::block_extract"]
        [::std::mem::offset_of!(retro_system_info, block_extract) - 25usize];
};
impl Default for retro_system_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_system_content_info_override {
    pub extensions: *const ::std::os::raw::c_char,
    pub need_fullpath: bool,
    pub persistent_data: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_system_content_info_override"]
        [::std::mem::size_of::<retro_system_content_info_override>() - 16usize];
    ["Alignment of retro_system_content_info_override"]
        [::std::mem::align_of::<retro_system_content_info_override>() - 8usize];
    ["Offset of field: retro_system_content_info_override::extensions"]
        [::std::mem::offset_of!(retro_system_content_info_override, extensions) - 0usize];
    ["Offset of field: retro_system_content_info_override::need_fullpath"]
        [::std::mem::offset_of!(retro_system_content_info_override, need_fullpath) - 8usize];
    ["Offset of field: retro_system_content_info_override::persistent_data"]
        [::std::mem::offset_of!(retro_system_content_info_override, persistent_data) - 9usize];
};
impl Default for retro_system_content_info_override {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_game_info_ext {
    pub full_path: *const ::std::os::raw::c_char,
    pub archive_path: *const ::std::os::raw::c_char,
    pub archive_file: *const ::std::os::raw::c_char,
    pub dir: *const ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub ext: *const ::std::os::raw::c_char,
    pub meta: *const ::std::os::raw::c_char,
    pub data: *const ::std::os::raw::c_void,
    pub size: usize,
    pub file_in_archive: bool,
    pub persistent_data: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_game_info_ext"][::std::mem::size_of::<retro_game_info_ext>() - 80usize];
    ["Alignment of retro_game_info_ext"][::std::mem::align_of::<retro_game_info_ext>() - 8usize];
    ["Offset of field: retro_game_info_ext::full_path"]
        [::std::mem::offset_of!(retro_game_info_ext, full_path) - 0usize];
    ["Offset of field: retro_game_info_ext::archive_path"]
        [::std::mem::offset_of!(retro_game_info_ext, archive_path) - 8usize];
    ["Offset of field: retro_game_info_ext::archive_file"]
        [::std::mem::offset_of!(retro_game_info_ext, archive_file) - 16usize];
    ["Offset of field: retro_game_info_ext::dir"]
        [::std::mem::offset_of!(retro_game_info_ext, dir) - 24usize];
    ["Offset of field: retro_game_info_ext::name"]
        [::std::mem::offset_of!(retro_game_info_ext, name) - 32usize];
    ["Offset of field: retro_game_info_ext::ext"]
        [::std::mem::offset_of!(retro_game_info_ext, ext) - 40usize];
    ["Offset of field: retro_game_info_ext::meta"]
        [::std::mem::offset_of!(retro_game_info_ext, meta) - 48usize];
    ["Offset of field: retro_game_info_ext::data"]
        [::std::mem::offset_of!(retro_game_info_ext, data) - 56usize];
    ["Offset of field: retro_game_info_ext::size"]
        [::std::mem::offset_of!(retro_game_info_ext, size) - 64usize];
    ["Offset of field: retro_game_info_ext::file_in_archive"]
        [::std::mem::offset_of!(retro_game_info_ext, file_in_archive) - 72usize];
    ["Offset of field: retro_game_info_ext::persistent_data"]
        [::std::mem::offset_of!(retro_game_info_ext, persistent_data) - 73usize];
};
impl Default for retro_game_info_ext {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Parameters describing the size and shape of the video frame.\n @see retro_system_av_info\n @see RETRO_ENVIRONMENT_SET_SYSTEM_AV_INFO\n @see RETRO_ENVIRONMENT_SET_GEOMETRY\n @see retro_get_system_av_info"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_game_geometry {
    #[doc = " Nominal video width of game, in pixels.\n This will typically be the emulated platform's native video width\n (or its smallest, if the original hardware supports multiple resolutions)."]
    pub base_width: ::std::os::raw::c_uint,
    #[doc = " Nominal video height of game, in pixels.\n This will typically be the emulated platform's native video height\n (or its smallest, if the original hardware supports multiple resolutions)."]
    pub base_height: ::std::os::raw::c_uint,
    #[doc = " Maximum possible width of the game screen, in pixels.\n This will typically be the emulated platform's maximum video width.\n For cores that emulate platforms with multiple screens (such as the Nintendo DS),\n this should assume the core's widest possible screen layout (e.g. side-by-side).\n For cores that support upscaling the resolution,\n this should assume the highest supported scale factor is active."]
    pub max_width: ::std::os::raw::c_uint,
    #[doc = " Maximum possible height of the game screen, in pixels.\n This will typically be the emulated platform's maximum video height.\n For cores that emulate platforms with multiple screens (such as the Nintendo DS),\n this should assume the core's tallest possible screen layout (e.g. vertical).\n For cores that support upscaling the resolution,\n this should assume the highest supported scale factor is active."]
    pub max_height: ::std::os::raw::c_uint,
    #[doc = " Nominal aspect ratio of game.\n If zero or less,\n an aspect ratio of <tt>base_width / base_height</tt> is assumed.\n\n @note A frontend may ignore this setting."]
    pub aspect_ratio: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_game_geometry"][::std::mem::size_of::<retro_game_geometry>() - 20usize];
    ["Alignment of retro_game_geometry"][::std::mem::align_of::<retro_game_geometry>() - 4usize];
    ["Offset of field: retro_game_geometry::base_width"]
        [::std::mem::offset_of!(retro_game_geometry, base_width) - 0usize];
    ["Offset of field: retro_game_geometry::base_height"]
        [::std::mem::offset_of!(retro_game_geometry, base_height) - 4usize];
    ["Offset of field: retro_game_geometry::max_width"]
        [::std::mem::offset_of!(retro_game_geometry, max_width) - 8usize];
    ["Offset of field: retro_game_geometry::max_height"]
        [::std::mem::offset_of!(retro_game_geometry, max_height) - 12usize];
    ["Offset of field: retro_game_geometry::aspect_ratio"]
        [::std::mem::offset_of!(retro_game_geometry, aspect_ratio) - 16usize];
};
#[doc = " Parameters describing the timing of the video and audio.\n @see retro_system_av_info\n @see RETRO_ENVIRONMENT_SET_SYSTEM_AV_INFO\n @see retro_get_system_av_info"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_system_timing {
    #[doc = " Video output refresh rate, in frames per second."]
    pub fps: f64,
    #[doc = " The audio output sample rate, in Hz."]
    pub sample_rate: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_system_timing"][::std::mem::size_of::<retro_system_timing>() - 16usize];
    ["Alignment of retro_system_timing"][::std::mem::align_of::<retro_system_timing>() - 8usize];
    ["Offset of field: retro_system_timing::fps"]
        [::std::mem::offset_of!(retro_system_timing, fps) - 0usize];
    ["Offset of field: retro_system_timing::sample_rate"]
        [::std::mem::offset_of!(retro_system_timing, sample_rate) - 8usize];
};
#[doc = " Configures how the core's audio and video should be updated.\n @see RETRO_ENVIRONMENT_SET_SYSTEM_AV_INFO\n @see retro_get_system_av_info"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_system_av_info {
    #[doc = " Parameters describing the size and shape of the video frame."]
    pub geometry: retro_game_geometry,
    #[doc = " Parameters describing the timing of the video and audio."]
    pub timing: retro_system_timing,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_system_av_info"][::std::mem::size_of::<retro_system_av_info>() - 40usize];
    ["Alignment of retro_system_av_info"][::std::mem::align_of::<retro_system_av_info>() - 8usize];
    ["Offset of field: retro_system_av_info::geometry"]
        [::std::mem::offset_of!(retro_system_av_info, geometry) - 0usize];
    ["Offset of field: retro_system_av_info::timing"]
        [::std::mem::offset_of!(retro_system_av_info, timing) - 24usize];
};
#[doc = " Represents \\ref RETRO_ENVIRONMENT_GET_VARIABLE \"a core option query\".\n\n @note In \\ref RETRO_ENVIRONMENT_SET_VARIABLES\n (which is a deprecated API),\n this \\c struct serves as an option definition.\n\n @see RETRO_ENVIRONMENT_GET_VARIABLE"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_variable {
    #[doc = " A unique key identifying this option.\n\n Should be a key for an option that was previously defined\n with \\ref RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2 or similar.\n\n Should be prefixed with the core's name\n to minimize the risk of collisions with another core's options,\n as frontends are not required to use a namespacing scheme for storing options.\n For example, a core named \"foo\" might define an option named \"foo_option\".\n\n @note In \\ref RETRO_ENVIRONMENT_SET_VARIABLES\n (which is a deprecated API),\n this field is used to define an option\n named by this key."]
    pub key: *const ::std::os::raw::c_char,
    #[doc = " Value to be obtained.\n\n Set by the frontend to \\c NULL if\n the option named by \\ref key does not exist.\n\n @note In \\ref RETRO_ENVIRONMENT_SET_VARIABLES\n (which is a deprecated API),\n this field is set by the core to define the possible values\n for an option named by \\ref key.\n When used this way, it must be formatted as follows:\n @li The text before the first ';' is the option's human-readable title.\n @li A single space follows the ';'.\n @li The rest of the string is a '|'-delimited list of possible values,\n with the first one being the default."]
    pub value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_variable"][::std::mem::size_of::<retro_variable>() - 16usize];
    ["Alignment of retro_variable"][::std::mem::align_of::<retro_variable>() - 8usize];
    ["Offset of field: retro_variable::key"][::std::mem::offset_of!(retro_variable, key) - 0usize];
    ["Offset of field: retro_variable::value"]
        [::std::mem::offset_of!(retro_variable, value) - 8usize];
};
impl Default for retro_variable {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " An argument that's used to show or hide a core option in the frontend.\n\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_DISPLAY"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_display {
    #[doc = " The key for a core option that was defined with \\ref RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2,\n \\ref RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2_INTL,\n or their legacy equivalents."]
    pub key: *const ::std::os::raw::c_char,
    #[doc = " Whether the option named by \\c key\n should be displayed to the player in the frontend's core options menu.\n\n @note This value is a hint, \\em not a requirement;\n the frontend is free to ignore this field."]
    pub visible: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_option_display"]
        [::std::mem::size_of::<retro_core_option_display>() - 16usize];
    ["Alignment of retro_core_option_display"]
        [::std::mem::align_of::<retro_core_option_display>() - 8usize];
    ["Offset of field: retro_core_option_display::key"]
        [::std::mem::offset_of!(retro_core_option_display, key) - 0usize];
    ["Offset of field: retro_core_option_display::visible"]
        [::std::mem::offset_of!(retro_core_option_display, visible) - 8usize];
};
impl Default for retro_core_option_display {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A descriptor for a particular choice within a core option.\n\n @note All option values are represented as strings.\n If you need to represent any other type,\n parse the string in \\ref value.\n\n @see retro_core_option_v2_category"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_value {
    #[doc = " The option value that the frontend will serialize.\n\n Must not be \\c NULL or empty.\n No other hard limits are placed on this value's contents,\n but here are some suggestions:\n\n \\li If the value represents a number,\n     don't include any non-digit characters (units, separators, etc.).\n     Instead, include that information in \\c label.\n     This will simplify parsing.\n \\li If the value represents a file path,\n     store it as a relative path with respect to one of the common libretro directories\n     (e.g. \\ref RETRO_ENVIRONMENT_GET_SYSTEM_DIRECTORY \"the system directory\"\n     or \\ref RETRO_ENVIRONMENT_GET_SAVE_DIRECTORY \"the save directory\"),\n     and use forward slashes (\\c \"/\") as directory separators.\n     This will simplify cloud storage if supported by the frontend,\n     as the same file may be used on multiple devices."]
    pub value: *const ::std::os::raw::c_char,
    #[doc = " Human-readable name for \\c value that the frontend should show to players.\n\n May be \\c NULL, in which case the frontend\n should display \\c value itself.\n\n Here are some guidelines for writing a good label:\n\n \\li Make the option labels obvious\n     so that they don't need to be explained in the description.\n \\li Keep labels short, and don't use unnecessary words.\n     For example, \"OpenGL\" is a better label than \"OpenGL Mode\".\n \\li If the option represents a number,\n     consider adding units, separators, or other punctuation\n     into the label itself.\n     For example, \"5 seconds\" is a better label than \"5\".\n \\li If the option represents a number, use intuitive units\n     that don't take a lot of digits to express.\n     For example, prefer \"1 minute\" over \"60 seconds\" or \"60,000 milliseconds\"."]
    pub label: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_option_value"][::std::mem::size_of::<retro_core_option_value>() - 16usize];
    ["Alignment of retro_core_option_value"]
        [::std::mem::align_of::<retro_core_option_value>() - 8usize];
    ["Offset of field: retro_core_option_value::value"]
        [::std::mem::offset_of!(retro_core_option_value, value) - 0usize];
    ["Offset of field: retro_core_option_value::label"]
        [::std::mem::offset_of!(retro_core_option_value, label) - 8usize];
};
impl Default for retro_core_option_value {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @copybrief retro_core_option_v2_definition\n\n @deprecated Use \\ref retro_core_option_v2_definition instead,\n as it supports categorizing options into groups.\n Only use this \\c struct to support older frontends or cores.\n\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_INTL"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_definition {
    #[doc = " @copydoc retro_core_option_v2_definition::key"]
    pub key: *const ::std::os::raw::c_char,
    #[doc = " @copydoc retro_core_option_v2_definition::desc"]
    pub desc: *const ::std::os::raw::c_char,
    #[doc = " @copydoc retro_core_option_v2_definition::info"]
    pub info: *const ::std::os::raw::c_char,
    #[doc = " @copydoc retro_core_option_v2_definition::values"]
    pub values: [retro_core_option_value; 128usize],
    #[doc = " @copydoc retro_core_option_v2_definition::default_value"]
    pub default_value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_option_definition"]
        [::std::mem::size_of::<retro_core_option_definition>() - 2080usize];
    ["Alignment of retro_core_option_definition"]
        [::std::mem::align_of::<retro_core_option_definition>() - 8usize];
    ["Offset of field: retro_core_option_definition::key"]
        [::std::mem::offset_of!(retro_core_option_definition, key) - 0usize];
    ["Offset of field: retro_core_option_definition::desc"]
        [::std::mem::offset_of!(retro_core_option_definition, desc) - 8usize];
    ["Offset of field: retro_core_option_definition::info"]
        [::std::mem::offset_of!(retro_core_option_definition, info) - 16usize];
    ["Offset of field: retro_core_option_definition::values"]
        [::std::mem::offset_of!(retro_core_option_definition, values) - 24usize];
    ["Offset of field: retro_core_option_definition::default_value"]
        [::std::mem::offset_of!(retro_core_option_definition, default_value) - 2072usize];
};
impl Default for retro_core_option_definition {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A variant of \\ref retro_core_options that supports internationalization.\n\n @deprecated Use \\ref retro_core_options_v2_intl instead,\n as it supports categorizing options into groups.\n Only use this \\c struct to support older frontends or cores.\n\n @see retro_core_options\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_INTL\n @see RETRO_ENVIRONMENT_GET_LANGUAGE\n @see retro_language"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_options_intl {
    #[doc = " @copydoc retro_core_options_v2_intl::us"]
    pub us: *mut retro_core_option_definition,
    #[doc = " @copydoc retro_core_options_v2_intl::local"]
    pub local: *mut retro_core_option_definition,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_options_intl"][::std::mem::size_of::<retro_core_options_intl>() - 16usize];
    ["Alignment of retro_core_options_intl"]
        [::std::mem::align_of::<retro_core_options_intl>() - 8usize];
    ["Offset of field: retro_core_options_intl::us"]
        [::std::mem::offset_of!(retro_core_options_intl, us) - 0usize];
    ["Offset of field: retro_core_options_intl::local"]
        [::std::mem::offset_of!(retro_core_options_intl, local) - 8usize];
};
impl Default for retro_core_options_intl {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A descriptor for a group of related core options.\n\n Here's an example category:\n\n @code\n {\n     \"cpu\",\n     \"CPU Emulation\",\n     \"Settings for CPU quirks.\"\n }\n @endcode\n\n @see retro_core_options_v2\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2_INTL"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_v2_category {
    #[doc = " A string that uniquely identifies this category within the core's options.\n Any \\c retro_core_option_v2_definition whose \\c category_key matches this\n is considered to be within this category.\n Different cores may use the same category keys,\n so namespacing them is not necessary.\n Valid characters are <tt>[a-zA-Z0-9_-]</tt>.\n\n Frontends should use this category to organize core options,\n but may customize this category's presentation in other ways.\n For example, a frontend may use common keys like \"audio\" or \"gfx\"\n to select an appropriate icon in its UI.\n\n Required; must not be \\c NULL."]
    pub key: *const ::std::os::raw::c_char,
    #[doc = " A brief human-readable name for this category,\n intended for the frontend to display to the player.\n This should be a name that's concise and descriptive, such as \"Audio\" or \"Video\".\n\n Required; must not be \\c NULL."]
    pub desc: *const ::std::os::raw::c_char,
    #[doc = " A human-readable description for this category,\n intended for the frontend to display to the player\n as secondary help text (e.g. a sublabel or a tooltip).\n Optional; may be \\c NULL or an empty string."]
    pub info: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_option_v2_category"]
        [::std::mem::size_of::<retro_core_option_v2_category>() - 24usize];
    ["Alignment of retro_core_option_v2_category"]
        [::std::mem::align_of::<retro_core_option_v2_category>() - 8usize];
    ["Offset of field: retro_core_option_v2_category::key"]
        [::std::mem::offset_of!(retro_core_option_v2_category, key) - 0usize];
    ["Offset of field: retro_core_option_v2_category::desc"]
        [::std::mem::offset_of!(retro_core_option_v2_category, desc) - 8usize];
    ["Offset of field: retro_core_option_v2_category::info"]
        [::std::mem::offset_of!(retro_core_option_v2_category, info) - 16usize];
};
impl Default for retro_core_option_v2_category {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A descriptor for a particular core option and the values it may take.\n\n Supports categorizing options into groups,\n so as not to overwhelm the player.\n\n @see retro_core_option_v2_category\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2_INTL"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_option_v2_definition {
    #[doc = " A unique identifier for this option that cores may use\n \\ref RETRO_ENVIRONMENT_GET_VARIABLE \"to query its value from the frontend\".\n Must be unique within this core.\n\n Should be unique globally;\n the recommended method for doing so\n is to prefix each option with the core's name.\n For example, an option that controls the resolution for a core named \"foo\"\n should be named \\c \"foo_resolution\".\n\n Valid key characters are in the set <tt>[a-zA-Z0-9_-]</tt>."]
    pub key: *const ::std::os::raw::c_char,
    #[doc = " A human-readable name for this option,\n intended to be displayed by frontends that don't support\n categorizing core options.\n\n Required; must not be \\c NULL or empty."]
    pub desc: *const ::std::os::raw::c_char,
    #[doc = " A human-readable name for this option,\n intended to be displayed by frontends that support\n categorizing core options.\n\n This version may be slightly more concise than \\ref desc,\n as it can rely on the structure of the options menu.\n For example, \"Interface\" is a good \\c desc_categorized,\n as it can be displayed as a sublabel for a \"Network\" category.\n For \\c desc, \"Network Interface\" would be more suitable.\n\n Optional; if this field or \\c category_key is empty or \\c NULL,\n \\c desc will be used instead."]
    pub desc_categorized: *const ::std::os::raw::c_char,
    #[doc = " A human-readable description of this option and its effects,\n intended to be displayed by frontends that don't support\n categorizing core options.\n\n @details Intended to be displayed as secondary help text,\n such as a tooltip or a sublabel.\n\n Here are some suggestions for writing a good description:\n\n \\li Avoid technical jargon unless this option is meant for advanced users.\n     If unavoidable, suggest one of the default options for those unsure.\n \\li Don't repeat the option name in the description;\n     instead, describe what the option name means.\n \\li If an option requires a core restart or game reset to take effect,\n     be sure to say so.\n \\li Try to make the option labels obvious\n     so that they don't need to be explained in the description.\n\n Optional; may be \\c NULL."]
    pub info: *const ::std::os::raw::c_char,
    #[doc = " @brief A human-readable description of this option and its effects,\n intended to be displayed by frontends that support\n categorizing core options.\n\n This version is provided to accommodate descriptions\n that reference other options by name,\n as options may have different user-facing names\n depending on whether the frontend supports categorization.\n\n @copydetails info\n\n If empty or \\c NULL, \\c info will be used instead.\n Will be ignored if \\c category_key is empty or \\c NULL."]
    pub info_categorized: *const ::std::os::raw::c_char,
    #[doc = " The key of the category that this option belongs to.\n\n Optional; if equal to \\ref retro_core_option_v2_category::key \"a defined category\",\n then this option shall be displayed by the frontend\n next to other options in this same category,\n assuming it supports doing so.\n Option categories are intended to be displayed in a submenu,\n but this isn't a hard requirement.\n\n If \\c NULL, empty, or not equal to a defined category,\n then this option is considered uncategorized\n and the frontend shall display it outside of any category\n (most likely at a top-level menu).\n\n @see retro_core_option_v2_category"]
    pub category_key: *const ::std::os::raw::c_char,
    #[doc = " One or more possible values for this option,\n up to the limit of \\ref RETRO_NUM_CORE_OPTION_VALUES_MAX.\n\n Terminated by a \\c { NULL, NULL } element,\n although frontends should work even if all elements are used."]
    pub values: [retro_core_option_value; 128usize],
    #[doc = " The default value for this core option.\n Used if it hasn't been set, e.g. for new cores.\n Must equal one of the \\ref value members in the \\c values array,\n or else this option will be ignored."]
    pub default_value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_option_v2_definition"]
        [::std::mem::size_of::<retro_core_option_v2_definition>() - 2104usize];
    ["Alignment of retro_core_option_v2_definition"]
        [::std::mem::align_of::<retro_core_option_v2_definition>() - 8usize];
    ["Offset of field: retro_core_option_v2_definition::key"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, key) - 0usize];
    ["Offset of field: retro_core_option_v2_definition::desc"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, desc) - 8usize];
    ["Offset of field: retro_core_option_v2_definition::desc_categorized"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, desc_categorized) - 16usize];
    ["Offset of field: retro_core_option_v2_definition::info"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, info) - 24usize];
    ["Offset of field: retro_core_option_v2_definition::info_categorized"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, info_categorized) - 32usize];
    ["Offset of field: retro_core_option_v2_definition::category_key"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, category_key) - 40usize];
    ["Offset of field: retro_core_option_v2_definition::values"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, values) - 48usize];
    ["Offset of field: retro_core_option_v2_definition::default_value"]
        [::std::mem::offset_of!(retro_core_option_v2_definition, default_value) - 2096usize];
};
impl Default for retro_core_option_v2_definition {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A set of core option descriptors and the categories that group them,\n suitable for enabling a core to be customized.\n\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_options_v2 {
    #[doc = " An array of \\ref retro_core_option_v2_category \"option categories\",\n terminated by a zeroed-out category \\c struct.\n\n Will be ignored if the frontend doesn't support core option categories.\n\n If \\c NULL or ignored, all options will be treated as uncategorized.\n This most likely means that a frontend will display them at a top-level menu\n without any kind of hierarchy or grouping."]
    pub categories: *mut retro_core_option_v2_category,
    #[doc = " An array of \\ref retro_core_option_v2_definition \"core option descriptors\",\n terminated by a zeroed-out definition \\c struct.\n\n Required; must not be \\c NULL."]
    pub definitions: *mut retro_core_option_v2_definition,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_options_v2"][::std::mem::size_of::<retro_core_options_v2>() - 16usize];
    ["Alignment of retro_core_options_v2"]
        [::std::mem::align_of::<retro_core_options_v2>() - 8usize];
    ["Offset of field: retro_core_options_v2::categories"]
        [::std::mem::offset_of!(retro_core_options_v2, categories) - 0usize];
    ["Offset of field: retro_core_options_v2::definitions"]
        [::std::mem::offset_of!(retro_core_options_v2, definitions) - 8usize];
};
impl Default for retro_core_options_v2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A variant of \\ref retro_core_options_v2 that supports internationalization.\n\n @see retro_core_options_v2\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2_INTL\n @see RETRO_ENVIRONMENT_GET_LANGUAGE\n @see retro_language"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_core_options_v2_intl {
    #[doc = " Pointer to a core options set\n whose text is written in American English.\n\n This may be passed to \\c RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2 as-is\n if not using \\c RETRO_ENVIRONMENT_SET_CORE_OPTIONS_V2_INTL.\n\n Required; must not be \\c NULL."]
    pub us: *mut retro_core_options_v2,
    #[doc = " Pointer to a core options set\n whose text is written in one of libretro's \\ref retro_language \"supported languages\",\n most likely the one returned by \\ref RETRO_ENVIRONMENT_GET_LANGUAGE.\n\n Structure is the same, but usage is slightly different:\n\n \\li All text (except for keys and option values)\n     should be written in whichever language\n     is returned by \\c RETRO_ENVIRONMENT_GET_LANGUAGE.\n \\li All fields besides keys and option values may be \\c NULL,\n     in which case the corresponding string in \\c us\n     is used instead.\n \\li All \\ref retro_core_option_v2_definition::default_value \"default option values\"\n     are taken from \\c us.\n     The defaults in this field are ignored.\n\n May be \\c NULL, in which case \\c us is used instead."]
    pub local: *mut retro_core_options_v2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_options_v2_intl"]
        [::std::mem::size_of::<retro_core_options_v2_intl>() - 16usize];
    ["Alignment of retro_core_options_v2_intl"]
        [::std::mem::align_of::<retro_core_options_v2_intl>() - 8usize];
    ["Offset of field: retro_core_options_v2_intl::us"]
        [::std::mem::offset_of!(retro_core_options_v2_intl, us) - 0usize];
    ["Offset of field: retro_core_options_v2_intl::local"]
        [::std::mem::offset_of!(retro_core_options_v2_intl, local) - 8usize];
};
impl Default for retro_core_options_v2_intl {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Called by the frontend to determine if any core option's visibility has changed.\n\n Each time a frontend sets a core option,\n it should call this function to see if\n any core option should be made visible or invisible.\n\n May also be called after \\ref retro_load_game \"loading a game\",\n to determine what the initial visibility of each option should be.\n\n Within this function, the core must update the visibility\n of any dynamically-hidden options\n using \\ref RETRO_ENVIRONMENT_SET_CORE_OPTIONS_DISPLAY.\n\n @note All core options are visible by default,\n even during this function's first call.\n\n @return \\c true if any core option's visibility was adjusted\n since the last call to this function.\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_DISPLAY\n @see retro_core_option_display"]
pub type retro_core_options_update_display_callback_t =
    ::std::option::Option<unsafe extern "C" fn() -> bool>;
#[doc = " Callback registered by the core for the frontend to use\n when setting the visibility of each core option.\n\n @see RETRO_ENVIRONMENT_SET_CORE_OPTIONS_DISPLAY\n @see retro_core_option_display"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_core_options_update_display_callback {
    #[doc = " @copydoc retro_core_options_update_display_callback_t\n\n Set by the core."]
    pub callback: retro_core_options_update_display_callback_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_core_options_update_display_callback"]
        [::std::mem::size_of::<retro_core_options_update_display_callback>() - 8usize];
    ["Alignment of retro_core_options_update_display_callback"]
        [::std::mem::align_of::<retro_core_options_update_display_callback>() - 8usize];
    ["Offset of field: retro_core_options_update_display_callback::callback"]
        [::std::mem::offset_of!(retro_core_options_update_display_callback, callback) - 0usize];
};
#[doc = " @}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_game_info {
    pub path: *const ::std::os::raw::c_char,
    pub data: *const ::std::os::raw::c_void,
    pub size: usize,
    pub meta: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_game_info"][::std::mem::size_of::<retro_game_info>() - 32usize];
    ["Alignment of retro_game_info"][::std::mem::align_of::<retro_game_info>() - 8usize];
    ["Offset of field: retro_game_info::path"]
        [::std::mem::offset_of!(retro_game_info, path) - 0usize];
    ["Offset of field: retro_game_info::data"]
        [::std::mem::offset_of!(retro_game_info, data) - 8usize];
    ["Offset of field: retro_game_info::size"]
        [::std::mem::offset_of!(retro_game_info, size) - 16usize];
    ["Offset of field: retro_game_info::meta"]
        [::std::mem::offset_of!(retro_game_info, meta) - 24usize];
};
impl Default for retro_game_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A frame buffer owned by the frontend that a core may use for rendering.\n\n @see GET_CURRENT_SOFTWARE_FRAMEBUFFER\n @see retro_video_refresh_t"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_framebuffer {
    #[doc = " Pointer to the beginning of the framebuffer provided by the frontend.\n The initial contents of this buffer are unspecified,\n as is the means used to map the memory;\n this may be defined in software,\n or it may be GPU memory mapped to RAM.\n\n If the framebuffer is used,\n this pointer must be passed to \\c retro_video_refresh_t as-is.\n It is undefined behavior to pass an offset to this pointer.\n\n @warning This pointer is only guaranteed to be valid\n for the duration of the same \\c retro_run iteration\n \\ref GET_CURRENT_SOFTWARE_FRAMEBUFFER \"that requested the framebuffer\".\n Reuse of this pointer is undefined."]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " The width of the framebuffer given in \\c data, in pixels.\n Set by the core.\n\n @warning If the framebuffer is used,\n this value must be passed to \\c retro_video_refresh_t as-is.\n It is undefined behavior to try to render \\c data with any other width."]
    pub width: ::std::os::raw::c_uint,
    #[doc = " The height of the framebuffer given in \\c data, in pixels.\n Set by the core.\n\n @warning If the framebuffer is used,\n this value must be passed to \\c retro_video_refresh_t as-is.\n It is undefined behavior to try to render \\c data with any other height."]
    pub height: ::std::os::raw::c_uint,
    #[doc = " The distance between the start of one scanline and the beginning of the next, in bytes.\n In practice this is usually equal to \\c width times the pixel size,\n but that's not guaranteed.\n Sometimes called the \"stride\".\n\n @setby{frontend}\n @warning If the framebuffer is used,\n this value must be passed to \\c retro_video_refresh_t as-is.\n It is undefined to try to render \\c data with any other pitch."]
    pub pitch: usize,
    #[doc = " The pixel format of the returned framebuffer.\n May be different than the format specified by the core in \\c RETRO_ENVIRONMENT_SET_PIXEL_FORMAT,\n e.g. due to conversions.\n Set by the frontend.\n\n @see RETRO_ENVIRONMENT_SET_PIXEL_FORMAT"]
    pub format: retro_pixel_format,
    #[doc = " One or more \\ref RETRO_MEMORY_ACCESS \"memory access flags\"\n that specify how the core will access the memory in \\c data.\n\n @setby{core}"]
    pub access_flags: ::std::os::raw::c_uint,
    #[doc = " Zero or more \\ref RETRO_MEMORY_TYPE \"memory type flags\"\n that describe how the framebuffer's memory has been mapped.\n\n @setby{frontend}"]
    pub memory_flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_framebuffer"][::std::mem::size_of::<retro_framebuffer>() - 40usize];
    ["Alignment of retro_framebuffer"][::std::mem::align_of::<retro_framebuffer>() - 8usize];
    ["Offset of field: retro_framebuffer::data"]
        [::std::mem::offset_of!(retro_framebuffer, data) - 0usize];
    ["Offset of field: retro_framebuffer::width"]
        [::std::mem::offset_of!(retro_framebuffer, width) - 8usize];
    ["Offset of field: retro_framebuffer::height"]
        [::std::mem::offset_of!(retro_framebuffer, height) - 12usize];
    ["Offset of field: retro_framebuffer::pitch"]
        [::std::mem::offset_of!(retro_framebuffer, pitch) - 16usize];
    ["Offset of field: retro_framebuffer::format"]
        [::std::mem::offset_of!(retro_framebuffer, format) - 24usize];
    ["Offset of field: retro_framebuffer::access_flags"]
        [::std::mem::offset_of!(retro_framebuffer, access_flags) - 28usize];
    ["Offset of field: retro_framebuffer::memory_flags"]
        [::std::mem::offset_of!(retro_framebuffer, memory_flags) - 32usize];
};
impl Default for retro_framebuffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Parameters that govern when and how the core takes control\n of fast-forwarding mode."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_fastforwarding_override {
    #[doc = " The factor by which the core will be sped up\n when \\c fastforward is \\c true.\n This value is used as follows:\n\n @li A value greater than 1.0 will run the core at\n     the specified multiple of normal speed.\n     For example, a value of 5.0\n     combined with a normal target rate of 60 FPS\n     will result in a target rate of 300 FPS.\n     The actual rate may be lower if the host's hardware can't keep up.\n @li A value of 1.0 will run the core at normal speed.\n @li A value between 0.0 (inclusive) and 1.0 (exclusive)\n     will run the core as fast as the host system can manage.\n @li A negative value will let the frontend choose a factor.\n @li An infinite value or \\c NaN results in undefined behavior.\n\n @attention Setting this value to less than 1.0 will \\em not\n slow down the core."]
    pub ratio: f32,
    #[doc = " If \\c true, the frontend should activate fast-forwarding\n until this field is set to \\c false or the core is unloaded."]
    pub fastforward: bool,
    #[doc = " If \\c true, the frontend should display an on-screen notification or icon\n while \\c fastforward is \\c true (where supported).\n Otherwise, the frontend should not display any such notification."]
    pub notification: bool,
    #[doc = " If \\c true, the core has exclusive control\n over enabling and disabling fast-forwarding\n via the \\c fastforward field.\n The frontend will not be able to start or stop fast-forwarding\n until this field is set to \\c false or the core is unloaded."]
    pub inhibit_toggle: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_fastforwarding_override"]
        [::std::mem::size_of::<retro_fastforwarding_override>() - 8usize];
    ["Alignment of retro_fastforwarding_override"]
        [::std::mem::align_of::<retro_fastforwarding_override>() - 4usize];
    ["Offset of field: retro_fastforwarding_override::ratio"]
        [::std::mem::offset_of!(retro_fastforwarding_override, ratio) - 0usize];
    ["Offset of field: retro_fastforwarding_override::fastforward"]
        [::std::mem::offset_of!(retro_fastforwarding_override, fastforward) - 4usize];
    ["Offset of field: retro_fastforwarding_override::notification"]
        [::std::mem::offset_of!(retro_fastforwarding_override, notification) - 5usize];
    ["Offset of field: retro_fastforwarding_override::inhibit_toggle"]
        [::std::mem::offset_of!(retro_fastforwarding_override, inhibit_toggle) - 6usize];
};
#[doc = " Details about the actual rate an implementation is calling \\c retro_run() at.\n\n @see RETRO_ENVIRONMENT_GET_THROTTLE_STATE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_throttle_state {
    #[doc = " The current throttling mode.\n\n @note Should be one of the \\c RETRO_THROTTLE_* values.\n @see RETRO_THROTTLE_NONE\n @see RETRO_THROTTLE_FRAME_STEPPING\n @see RETRO_THROTTLE_FAST_FORWARD\n @see RETRO_THROTTLE_SLOW_MOTION\n @see RETRO_THROTTLE_REWINDING\n @see RETRO_THROTTLE_VSYNC\n @see RETRO_THROTTLE_UNBLOCKED"]
    pub mode: ::std::os::raw::c_uint,
    #[doc = " How many times per second the frontend aims to call retro_run.\n\n @note Depending on the mode, it can be 0 if there is no known fixed rate.\n This won't be accurate if the total processing time of the core and\n the frontend is longer than what is available for one frame."]
    pub rate: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_throttle_state"][::std::mem::size_of::<retro_throttle_state>() - 8usize];
    ["Alignment of retro_throttle_state"][::std::mem::align_of::<retro_throttle_state>() - 4usize];
    ["Offset of field: retro_throttle_state::mode"]
        [::std::mem::offset_of!(retro_throttle_state, mode) - 0usize];
    ["Offset of field: retro_throttle_state::rate"]
        [::std::mem::offset_of!(retro_throttle_state, rate) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_microphone {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a microphone that's been opened for use.\n The underlying object is accessed or created with \\c retro_microphone_interface_t."]
pub type retro_microphone_t = retro_microphone;
#[doc = " Parameters for configuring a microphone.\n Some of these might not be honored,\n depending on the available hardware and driver configuration."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_microphone_params {
    #[doc = " The desired sample rate of the microphone's input, in Hz.\n The microphone's input will be resampled,\n so cores can ask for whichever frequency they need.\n\n If zero, some reasonable default will be provided by the frontend\n (usually from its config file).\n\n @see retro_get_mic_rate_t"]
    pub rate: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_microphone_params"][::std::mem::size_of::<retro_microphone_params>() - 4usize];
    ["Alignment of retro_microphone_params"]
        [::std::mem::align_of::<retro_microphone_params>() - 4usize];
    ["Offset of field: retro_microphone_params::rate"]
        [::std::mem::offset_of!(retro_microphone_params, rate) - 0usize];
};
#[doc = " Parameters for configuring a microphone.\n Some of these might not be honored,\n depending on the available hardware and driver configuration."]
pub type retro_microphone_params_t = retro_microphone_params;
#[doc = " @copydoc retro_microphone_interface::open_mic"]
pub type retro_open_mic_t = ::std::option::Option<
    unsafe extern "C" fn(params: *const retro_microphone_params_t) -> *mut retro_microphone_t,
>;
#[doc = " @copydoc retro_microphone_interface::close_mic"]
pub type retro_close_mic_t =
    ::std::option::Option<unsafe extern "C" fn(microphone: *mut retro_microphone_t)>;
#[doc = " @copydoc retro_microphone_interface::get_params"]
pub type retro_get_mic_params_t = ::std::option::Option<
    unsafe extern "C" fn(
        microphone: *const retro_microphone_t,
        params: *mut retro_microphone_params_t,
    ) -> bool,
>;
#[doc = " @copydoc retro_microphone_interface::set_mic_state"]
pub type retro_set_mic_state_t = ::std::option::Option<
    unsafe extern "C" fn(microphone: *mut retro_microphone_t, state: bool) -> bool,
>;
#[doc = " @copydoc retro_microphone_interface::get_mic_state"]
pub type retro_get_mic_state_t =
    ::std::option::Option<unsafe extern "C" fn(microphone: *const retro_microphone_t) -> bool>;
#[doc = " @copydoc retro_microphone_interface::read_mic"]
pub type retro_read_mic_t = ::std::option::Option<
    unsafe extern "C" fn(
        microphone: *mut retro_microphone_t,
        samples: *mut i16,
        num_samples: usize,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " An interface for querying the microphone and accessing data read from it.\n\n @see RETRO_ENVIRONMENT_GET_MICROPHONE_INTERFACE"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct retro_microphone_interface {
    #[doc = " The version of this microphone interface.\n Set by the core to request a particular version,\n and set by the frontend to indicate the returned version.\n 0 indicates that the interface is invalid or uninitialized."]
    pub interface_version: ::std::os::raw::c_uint,
    #[doc = " Initializes a new microphone.\n Assuming that microphone support is enabled and provided by the frontend,\n cores may call this function whenever necessary.\n A microphone could be opened throughout a core's lifetime,\n or it could wait until a microphone is plugged in to the emulated device.\n\n The returned handle will be valid until it's freed,\n even if the audio driver is reinitialized.\n\n This function is not guaranteed to be thread-safe.\n\n @param[in] args Parameters used to create the microphone.\n May be \\c NULL, in which case the default value of each parameter will be used.\n\n @returns Pointer to the newly-opened microphone,\n or \\c NULL if one couldn't be opened.\n This likely means that no microphone is plugged in and recognized,\n or the maximum number of supported microphones has been reached.\n\n @note Microphones are \\em inactive by default;\n to begin capturing audio, call \\c set_mic_state.\n @see retro_microphone_params_t"]
    pub open_mic: retro_open_mic_t,
    #[doc = " Closes a microphone that was initialized with \\c open_mic.\n Calling this function will stop all microphone activity\n and free up the resources that it allocated.\n Afterwards, the handle is invalid and must not be used.\n\n A frontend may close opened microphones when unloading content,\n but this behavior is not guaranteed.\n Cores should close their microphones when exiting, just to be safe.\n\n @param microphone Pointer to the microphone that was allocated by \\c open_mic.\n If \\c NULL, this function does nothing.\n\n @note The handle might be reused if another microphone is opened later."]
    pub close_mic: retro_close_mic_t,
    #[doc = " Returns the configured parameters of this microphone.\n These may differ from what was requested depending on\n the driver and device configuration.\n\n Cores should check these values before they start fetching samples.\n\n Will not change after the mic was opened.\n\n @param[in] microphone Opaque handle to the microphone\n whose parameters will be retrieved.\n @param[out] params The parameters object that the\n microphone's parameters will be copied to.\n\n @return \\c true if the parameters were retrieved,\n \\c false if there was an error."]
    pub get_params: retro_get_mic_params_t,
    #[doc = " Enables or disables the given microphone.\n Microphones are disabled by default\n and must be explicitly enabled before they can be used.\n Disabled microphones will not process incoming audio samples,\n and will therefore have minimal impact on overall performance.\n Cores may enable microphones throughout their lifetime,\n or only for periods where they're needed.\n\n Cores that accept microphone input should be able to operate without it;\n we suggest substituting silence in this case.\n\n @param microphone Opaque handle to the microphone\n whose state will be adjusted.\n This will have been provided by \\c open_mic.\n @param state \\c true if the microphone should receive audio input,\n \\c false if it should be idle.\n @returns \\c true if the microphone's state was successfully set,\n \\c false if \\c microphone is invalid\n or if there was an error."]
    pub set_mic_state: retro_set_mic_state_t,
    #[doc = " Queries the active state of a microphone at the given index.\n Will return whether the microphone is enabled,\n even if the driver is paused.\n\n @param microphone Opaque handle to the microphone\n whose state will be queried.\n @return \\c true if the provided \\c microphone is valid and active,\n \\c false if not or if there was an error."]
    pub get_mic_state: retro_get_mic_state_t,
    #[doc = " Retrieves the input processed by the microphone since the last call.\n \\em Must be called every frame unless \\c microphone is disabled,\n similar to how \\c retro_audio_sample_batch_t works.\n\n @param[in] microphone Opaque handle to the microphone\n whose recent input will be retrieved.\n @param[out] samples The buffer that will be used to store the microphone's data.\n Microphone input is in mono (i.e. one number per sample).\n Should be large enough to accommodate the expected number of samples per frame;\n for example, a 44.1kHz sample rate at 60 FPS would require space for 735 samples.\n @param[in] num_samples The size of the data buffer in samples (\\em not bytes).\n Microphone input is in mono, so a \"frame\" and a \"sample\" are equivalent in length here.\n\n @return The number of samples that were copied into \\c samples.\n If \\c microphone is pending driver initialization,\n this function will copy silence of the requested length into \\c samples.\n\n Will return -1 if the microphone is disabled,\n the audio driver is paused,\n or there was an error."]
    pub read_mic: retro_read_mic_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_microphone_interface"]
        [::std::mem::size_of::<retro_microphone_interface>() - 56usize];
    ["Alignment of retro_microphone_interface"]
        [::std::mem::align_of::<retro_microphone_interface>() - 8usize];
    ["Offset of field: retro_microphone_interface::interface_version"]
        [::std::mem::offset_of!(retro_microphone_interface, interface_version) - 0usize];
    ["Offset of field: retro_microphone_interface::open_mic"]
        [::std::mem::offset_of!(retro_microphone_interface, open_mic) - 8usize];
    ["Offset of field: retro_microphone_interface::close_mic"]
        [::std::mem::offset_of!(retro_microphone_interface, close_mic) - 16usize];
    ["Offset of field: retro_microphone_interface::get_params"]
        [::std::mem::offset_of!(retro_microphone_interface, get_params) - 24usize];
    ["Offset of field: retro_microphone_interface::set_mic_state"]
        [::std::mem::offset_of!(retro_microphone_interface, set_mic_state) - 32usize];
    ["Offset of field: retro_microphone_interface::get_mic_state"]
        [::std::mem::offset_of!(retro_microphone_interface, get_mic_state) - 40usize];
    ["Offset of field: retro_microphone_interface::read_mic"]
        [::std::mem::offset_of!(retro_microphone_interface, read_mic) - 48usize];
};
#[doc = " Indicates that the frontend cannot report its power state at this time,\n most likely due to a lack of support.\n\n \\c RETRO_ENVIRONMENT_GET_DEVICE_POWER will not return this value;\n instead, the environment callback will return \\c false."]
pub const RETRO_POWERSTATE_UNKNOWN: retro_power_state = 0;
#[doc = " Indicates that the device is running on its battery.\n Usually applies to portable devices such as handhelds, laptops, and smartphones."]
pub const RETRO_POWERSTATE_DISCHARGING: retro_power_state = 1;
#[doc = " Indicates that the device's battery is currently charging."]
pub const RETRO_POWERSTATE_CHARGING: retro_power_state = 2;
#[doc = " Indicates that the device is connected to a power source\n and that its battery has finished charging."]
pub const RETRO_POWERSTATE_CHARGED: retro_power_state = 3;
#[doc = " Indicates that the device is connected to a power source\n and that it does not have a battery.\n This usually suggests a desktop computer or a non-portable game console."]
pub const RETRO_POWERSTATE_PLUGGED_IN: retro_power_state = 4;
#[doc = " Describes how a device is being powered.\n @see RETRO_ENVIRONMENT_GET_DEVICE_POWER"]
pub type retro_power_state = ::std::os::raw::c_uint;
#[doc = " Describes the power state of the device running the frontend.\n @see RETRO_ENVIRONMENT_GET_DEVICE_POWER"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct retro_device_power {
    #[doc = " The current state of the frontend's power usage."]
    pub state: retro_power_state,
    #[doc = " A rough estimate of the amount of time remaining (in seconds)\n before the device powers off.\n This value depends on a variety of factors,\n so it is not guaranteed to be accurate.\n\n Will be set to \\c RETRO_POWERSTATE_NO_ESTIMATE if \\c state does not equal \\c RETRO_POWERSTATE_DISCHARGING.\n May still be set to \\c RETRO_POWERSTATE_NO_ESTIMATE if the frontend is unable to provide an estimate."]
    pub seconds: ::std::os::raw::c_int,
    #[doc = " The approximate percentage of battery charge,\n ranging from 0 to 100 (inclusive).\n The device may power off before this reaches 0.\n\n The user might have configured their device\n to stop charging before the battery is full,\n so do not assume that this will be 100 in the \\c RETRO_POWERSTATE_CHARGED state."]
    pub percent: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of retro_device_power"][::std::mem::size_of::<retro_device_power>() - 12usize];
    ["Alignment of retro_device_power"][::std::mem::align_of::<retro_device_power>() - 4usize];
    ["Offset of field: retro_device_power::state"]
        [::std::mem::offset_of!(retro_device_power, state) - 0usize];
    ["Offset of field: retro_device_power::seconds"]
        [::std::mem::offset_of!(retro_device_power, seconds) - 4usize];
    ["Offset of field: retro_device_power::percent"]
        [::std::mem::offset_of!(retro_device_power, percent) - 8usize];
};
impl Default for retro_device_power {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Environment callback to give implementations a way of performing uncommon tasks.\n\n @note Extensible.\n\n @param cmd The command to run.\n @param data A pointer to the data associated with the command.\n\n @return Varies by callback,\n but will always return \\c false if the command is not recognized.\n\n @see RETRO_ENVIRONMENT_SET_ROTATION\n @see retro_set_environment()"]
pub type retro_environment_t = ::std::option::Option<
    unsafe extern "C" fn(cmd: ::std::os::raw::c_uint, data: *mut ::std::os::raw::c_void) -> bool,
>;
